// AnimBlueprintGeneratedClass ABP_KanbanGirl.ABP_KanbanGirl_C
// Size: 0x2a40 (Inherited: 0x2c0)
struct UABP_KanbanGirl_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x2c8(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7; // 0x348(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x3e8(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x488(0x118)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x5a0(0x368)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_2; // 0x908(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x9a8(0x80)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0xa28(0xa0)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_6; // 0xac8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xb68(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xcc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xce8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xd10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xd38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xd60(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xd88(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xe08(0x158)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5; // 0xf60(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1000(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1080(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1100(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1180(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x12d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1358(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4; // 0x13d8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1478(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x15d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x15f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1620(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x1648(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1710(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1790(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1810(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1890(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1960(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1988(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1a08(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1a88(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x1b08(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1bd0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1c50(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1d18(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1db8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1e38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1eb8(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x1f38(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1fd8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2058(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x20d8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2178(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x21a8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2228(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x22f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2370(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x23f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2470(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x24f0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2590(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2630(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x26b0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2778(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x27f8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2828(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x28d8(0x30)
	struct FAnimNode_ModifyMapCurve AnimGraphNode_ModifyMapCurve; // 0x2908(0x98)
	bool __CustomProperty_isjuwai_FE5E04EC4B631CA79F4141A75D414B93; // 0x29a0(0x01)
	bool StartGame; // 0x29a1(0x01)
	char pad_29A2[0x2]; // 0x29a2(0x02)
	int32_t Active Child Index; // 0x29a4(0x04)
	struct FLiveLinkSubjectName Live Link Subject Name; // 0x29a8(0x08)
	bool isbiaoqing; // 0x29b0(0x01)
	bool IsGhost; // 0x29b1(0x01)
	char pad_29B2[0x2]; // 0x29b2(0x02)
	int32_t humanindex; // 0x29b4(0x04)
	bool kanbanmove; // 0x29b8(0x01)
	char pad_29B9[0x7]; // 0x29b9(0x07)
	struct TMap<struct FName, float> Curve Map Values; // 0x29c0(0x50)
	bool tostand; // 0x2a10(0x01)
	char pad_2A11[0x7]; // 0x2a11(0x07)
	struct UAnimSequenceBase* showone; // 0x2a18(0x08)
	struct UAnimSequenceBase* showtwo; // 0x2a20(0x08)
	struct UAnimSequenceBase* showthree; // 0x2a28(0x08)
	struct UAnimSequenceBase* bqsequence; // 0x2a30(0x08)
	struct UAnimSequenceBase* Stand; // 0x2a38(0x08)

	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void Switch Nielian(int32_t Index, float Value); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.Switch Nielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void defalutnielian(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.defalutnielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void nielian(int32_t idex); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.nielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KanbanGirl_AnimGraphNode_TransitionResult_2216AEDA4CE4C349344747B21D4C26EE(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KanbanGirl_AnimGraphNode_TransitionResult_2216AEDA4CE4C349344747B21D4C26EE // (BlueprintEvent) // @ game+0x1ec38f0
	void BlueprintInitializeAnimation(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_RandomInt(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.AnimNotify_RandomInt // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_timerandom(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.AnimNotify_timerandom // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_randomtimeidle(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.AnimNotify_randomtimeidle // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void setHumanindex(int32_t humanindex); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.setHumanindex // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetGhost(bool IsGhost); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.SetGhost // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetCharacterid(int32_t ConfigID); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.SetCharacterid // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_tostand(); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.AnimNotify_tostand // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void ExecuteUbergraph_ABP_KanbanGirl(int32_t EntryPoint); // Function ABP_KanbanGirl.ABP_KanbanGirl_C.ExecuteUbergraph_ABP_KanbanGirl // (Final|UbergraphFunction|HasDefaults) // @ game+0x1ec38f0
};

