// AnimBlueprintGeneratedClass ABP_Niexiaoqian.ABP_Niexiaoqian_C
// Size: 0xe0d0 (Inherited: 0x2c0)
struct UABP_Niexiaoqian_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0x2c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0x420(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x448(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x470(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x498(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x4c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x4e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x510(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x538(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x560(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x5b0(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_27; // 0x5d8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0x630(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0x658(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0x680(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0x6a8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_19; // 0x6d0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x720(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_26; // 0x750(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0x7a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0x7d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0x7f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0x820(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_18; // 0x848(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x898(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_25; // 0x8c8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0x920(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x948(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x970(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_17; // 0x998(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x9e8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0xa10(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24; // 0xa40(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0xa98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0xac0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0xae8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_16; // 0xb10(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0xb60(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0xb88(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23; // 0xbb8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0xc10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0xc38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0xc60(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_15; // 0xc88(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0xcd8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0xd00(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22; // 0xd30(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0xd88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0xdb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0xdd8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_14; // 0xe00(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0xe50(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0xe78(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0xea8(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xf58(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x1008(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_19; // 0x1038(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x1150(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x12a8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x12d0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x1318(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x1470(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x1498(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x14c0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x1580(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x15a8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0x15f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x1748(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1770(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x17b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x1910(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x1938(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x1980(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x1ad8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x1b98(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x1c58(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x1d18(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21; // 0x1d40(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x1d98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x1dc0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x1de8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x1e18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x1e40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x1e68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x1e90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x1eb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x1ee0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x1f08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x1f30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x1f58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x1f80(0x28)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_5; // 0x1fa8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x2098(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_4; // 0x20c8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x21b8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x21e8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x22d8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x2308(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x23f8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x2428(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x2518(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x2548(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x25f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x2628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x2650(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x2678(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x26c8(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x26f8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x2748(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x2778(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x2828(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x2858(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x2908(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_18; // 0x2938(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2a50(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x2a70(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x2b78(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x2c80(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x2e60(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x3040(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x3148(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3250(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x3270(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x3378(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3480(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3588(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_17; // 0x35b8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16; // 0x36d0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15; // 0x37e8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14; // 0x3900(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13; // 0x3a18(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12; // 0x3b30(0x118)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x3c48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x3c70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x3c98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x3cc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x3ce8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x3d10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x3d38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x3d60(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20; // 0x3d88(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x3de0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x3e08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x3e30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x3e58(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_13; // 0x3e80(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x3ed0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19; // 0x3f00(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x3f58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x3f80(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_12; // 0x3fa8(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x3ff8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x4020(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4048(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18; // 0x4078(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x40d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x40f8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_11; // 0x4120(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x4170(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x4198(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x41c0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17; // 0x41f0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x4248(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x4270(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x4298(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x42c0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_10; // 0x42e8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x4338(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x4368(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x4390(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x43b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x43e0(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16; // 0x4408(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_9; // 0x4460(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x44b0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x44e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x4508(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x4530(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x4558(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15; // 0x4580(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_8; // 0x45d8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x4628(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x4658(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x4708(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x4860(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x49b8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x4b10(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x4c68(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x4dc0(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11; // 0x4f18(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x5030(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x5188(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x52e0(0x28)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x5308(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10; // 0x5338(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9; // 0x5450(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x5568(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x56c0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x5818(0x158)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x5970(0x38)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x59a8(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x59e0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x5b38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x5c90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x5cb8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x5ce0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x5d08(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x5d30(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x5e00(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x5ec8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x5f10(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x6068(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x6090(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x60b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x60e0(0xc0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x61a0(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x6270(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x6338(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x6380(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x63a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x63d0(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x63f8(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x64c8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x6590(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x65d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x6600(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x6628(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x6650(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x6720(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x67e8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x6830(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x6858(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x6880(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x68a8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x6970(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x69b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x69e0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x6a08(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x6ad0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x6b18(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x6b40(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x6b68(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x6cc0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x6e18(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x6f70(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x70c8(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x7220(0x118)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7338(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7360(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x7388(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x73b0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x73d8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x74a0(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x7568(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x7628(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x76e8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x77a8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x77d0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x7890(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x7950(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x7978(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x7a38(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x7af8(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x7b40(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x7c00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x7c28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x7c50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x7c78(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x7ca0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x7cc8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x7cf0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x7d18(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x7d40(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x7e00(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x7e30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x7e58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x7e80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x7ea8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x7ed0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x7ef8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x7f20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x7f48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x7f70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x7f98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x7fc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x7fe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x8010(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x8038(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x8060(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x8088(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x80b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x80d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x8100(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14; // 0x8128(0x58)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x8180(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x8250(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x8318(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x8398(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x8418(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x8448(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x8470(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13; // 0x8498(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x84f0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x85b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x8638(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x86b8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12; // 0x86e8(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x8740(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x8808(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x8858(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x88a8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x8970(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8a38(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x8b20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x8b48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x8b70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x8b98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x8bc0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x8be8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x8c68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x8c98(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x8d18(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x8d48(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x8e10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x8e90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x8f10(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x8f40(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x9008(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x9088(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x9108(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x9138(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x9168(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x9218(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x9248(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x9298(0xc8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11; // 0x9360(0x58)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x93b8(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x9408(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x94d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x9550(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x9580(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10; // 0x95a8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x9600(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x9630(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x96e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x9708(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9; // 0x9730(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x9788(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x97b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x97e8(0xb0)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_7; // 0x9898(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x98e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x9968(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x99e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x9a68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x9ae8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x9b18(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x9bc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x9bf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x9c18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x9c40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x9c68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x9c90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x9cb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x9ce0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x9d08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x9d30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x9d58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x9d80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x9da8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x9dd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x9e50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x9ed0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x9f50(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_6; // 0x9fd0(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xa020(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xa0e8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xa118(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xa140(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xa168(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xa1e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xa268(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xa2e8(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_5; // 0xa368(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xa3b8(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xa480(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xa4b0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xa4d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xa558(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xa5d8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xa658(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_4; // 0xa6d8(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xa728(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xa7f0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xa820(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xa848(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xa878(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xa8a0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xa8d0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xa8f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xa978(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xa9f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xaa78(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_3; // 0xaaf8(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xab48(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xac10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xac40(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xacf0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xad38(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xae90(0x158)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xafe8(0x70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xb058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xb080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xb0a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xb0d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xb0f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xb120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xb148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xb170(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb198(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8; // 0xb218(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xb270(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb2a0(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7; // 0xb320(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xb378(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xb3a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xb3d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xb3f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xb420(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xb448(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xb470(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0xb498(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0xb4e8(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xb538(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0xb5e8(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xb638(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0xb6e8(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_2; // 0xb738(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xb788(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xb7d8(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xb828(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6; // 0xb8e8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xb940(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xb970(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xb998(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xb9e8(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xba38(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xbae8(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xbb38(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0xbbe8(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend; // 0xbc38(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xbc88(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xbcd8(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xbd28(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0xbde8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xbe40(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0xbe70(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xbec8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xbef0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0xbf20(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xbf78(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xbfa0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xbfd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xbff8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xc020(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xc048(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xc078(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xc128(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xc158(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc180(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xc1b0(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0xc230(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xc288(0x48)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xc2d0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc328(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc358(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xc408(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xc560(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xc6b8(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xc700(0x30)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0xc730(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xc7d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xc7f8(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0xc820(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xc8d0(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xca28(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xcaf0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xcc48(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xcda0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xcef8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xd050(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0xd1a8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0xd2c0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0xd3d8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0xd4f0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0xd608(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xd720(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xd878(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0xd9d0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xdae8(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xdc00(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xdc30(0xb0)
	bool __CustomProperty_isman_E4AAFBE74E38C273AE31CEB0FFBCFA74; // 0xdce0(0x01)
	char pad_DCE1[0x3]; // 0xdce1(0x03)
	struct FRotator AimingRotation; // 0xdce4(0x0c)
	struct FVector Velocity; // 0xdcf0(0x0c)
	struct FVector RelativeVelocityDirection; // 0xdcfc(0x0c)
	struct FVector Acceleration; // 0xdd08(0x0c)
	struct FVector MovementInput; // 0xdd14(0x0c)
	bool IsMoving; // 0xdd20(0x01)
	bool HasMovementInput; // 0xdd21(0x01)
	char pad_DD22[0x2]; // 0xdd22(0x02)
	float Speed; // 0xdd24(0x04)
	float MovementInputAmount; // 0xdd28(0x04)
	enum class GroundedEntryState GroundedEntryState; // 0xdd2c(0x01)
	enum class MovementDirection MovementDirection; // 0xdd2d(0x01)
	enum class HipsDirection TrackedHipsDirection; // 0xdd2e(0x01)
	char pad_DD2F[0x1]; // 0xdd2f(0x01)
	struct FVector RelativeAccelerationAmount; // 0xdd30(0x0c)
	bool ShouldMove; // 0xdd3c(0x01)
	bool Rotate_L; // 0xdd3d(0x01)
	bool Rotate_R; // 0xdd3e(0x01)
	bool Pivot; // 0xdd3f(0x01)
	float RotateRate; // 0xdd40(0x04)
	float RotationScale; // 0xdd44(0x04)
	float DiagonalScaleAmount; // 0xdd48(0x04)
	float WalkRunBlend; // 0xdd4c(0x04)
	float StandingPlayRate; // 0xdd50(0x04)
	float CrouchingPlayRate; // 0xdd54(0x04)
	float StrideBlend; // 0xdd58(0x04)
	struct FVelocityBlend VelocityBlend; // 0xdd5c(0x10)
	struct FLeanAmount LeanAmount; // 0xdd6c(0x08)
	char pad_DD74[0x4]; // 0xdd74(0x04)
	struct UCurveFloat* DiagonalScaleAmountCurve; // 0xdd78(0x08)
	struct UCurveFloat* StrideBlend_N_Walk; // 0xdd80(0x08)
	struct UCurveFloat* StrideBlend_N_Run; // 0xdd88(0x08)
	struct UCurveFloat* StrideBlend_C_Walk; // 0xdd90(0x08)
	struct FRotator SmoothedAimingRotation; // 0xdd98(0x0c)
	struct FRotator SpineRotation; // 0xdda4(0x0c)
	struct FVector2D AimingAngle; // 0xddb0(0x08)
	struct FVector2D SmoothedAimingAngle; // 0xddb8(0x08)
	float AimSweepTime; // 0xddc0(0x04)
	float AimYawRate; // 0xddc4(0x04)
	float ZoomAmount; // 0xddc8(0x04)
	bool Jumped; // 0xddcc(0x01)
	char pad_DDCD[0x3]; // 0xddcd(0x03)
	float JumpPlayRate; // 0xddd0(0x04)
	float FallSpeed; // 0xddd4(0x04)
	float LandPrediction; // 0xddd8(0x04)
	char pad_DDDC[0x4]; // 0xdddc(0x04)
	struct UCurveFloat* LandPredictionCurve; // 0xdde0(0x08)
	struct UCurveFloat* LeanInAirCurve; // 0xdde8(0x08)
	int32_t OverlayOverrideState; // 0xddf0(0x04)
	float Enable_AimOffset; // 0xddf4(0x04)
	float FootLock_L_Alpha; // 0xddf8(0x04)
	float FootLock_R_Alpha; // 0xddfc(0x04)
	struct FVector FootLock_L_Location; // 0xde00(0x0c)
	struct FVector FootLock_R_Location; // 0xde0c(0x0c)
	struct FRotator FootLock_L_Rotation; // 0xde18(0x0c)
	struct FRotator FootLock_R_Rotation; // 0xde24(0x0c)
	struct FVector FootOffset_L_Location; // 0xde30(0x0c)
	struct FVector FootOffset_R_Location; // 0xde3c(0x0c)
	struct FRotator FootOffset_L_Rotation; // 0xde48(0x0c)
	struct FRotator FootOffset_R_Rotation; // 0xde54(0x0c)
	struct FVector PelvisOffset; // 0xde60(0x0c)
	float PelvisAlpha; // 0xde6c(0x04)
	struct ACharacter* Character; // 0xde70(0x08)
	float DeltaTimeX; // 0xde78(0x04)
	float TurnCheckMinAngle; // 0xde7c(0x04)
	float Turn180Threshold; // 0xde80(0x04)
	float AimYawRateLimit; // 0xde84(0x04)
	float ElapsedDelayTime; // 0xde88(0x04)
	enum class ALS_MovementState MovementState; // 0xde8c(0x01)
	enum class ALS_MovementAction MovementAction; // 0xde8d(0x01)
	enum class ALS_RotationMode RotationMode; // 0xde8e(0x01)
	enum class ALS_Gait Gait; // 0xde8f(0x01)
	enum class ALS_Stance Stance; // 0xde90(0x01)
	enum class ALS_ViewMode ViewMode; // 0xde91(0x01)
	enum class ALS_OverlayState overlaystate; // 0xde92(0x01)
	char pad_DE93[0x1]; // 0xde93(0x01)
	float BasePose_N; // 0xde94(0x04)
	float BasePose_CLF; // 0xde98(0x04)
	float Arm_L; // 0xde9c(0x04)
	float Arm_L_Add; // 0xdea0(0x04)
	float Arm_L_LS; // 0xdea4(0x04)
	float Arm_L_MS; // 0xdea8(0x04)
	float Arm_R; // 0xdeac(0x04)
	float Arm_R_Add; // 0xdeb0(0x04)
	float Arm_R_LS; // 0xdeb4(0x04)
	float Arm_R_MS; // 0xdeb8(0x04)
	float hand_l; // 0xdebc(0x04)
	float hand_r; // 0xdec0(0x04)
	float Legs; // 0xdec4(0x04)
	float Legs_Add; // 0xdec8(0x04)
	float pelvis; // 0xdecc(0x04)
	float Pelvis_Add; // 0xded0(0x04)
	float Spine; // 0xded4(0x04)
	float Spine_Add; // 0xded8(0x04)
	float head; // 0xdedc(0x04)
	float Head_Add; // 0xdee0(0x04)
	char pad_DEE4[0x4]; // 0xdee4(0x04)
	struct UCurveVector* YawOffset_FB; // 0xdee8(0x08)
	struct UCurveVector* YawOffset_LR; // 0xdef0(0x08)
	float FYaw; // 0xdef8(0x04)
	float BYaw; // 0xdefc(0x04)
	float LYaw; // 0xdf00(0x04)
	float RYaw; // 0xdf04(0x04)
	float InputYawOffsetTime; // 0xdf08(0x04)
	float ForwardYawTime; // 0xdf0c(0x04)
	float LeftYawTime; // 0xdf10(0x04)
	float RightYawTime; // 0xdf14(0x04)
	float MinAngleDelay; // 0xdf18(0x04)
	float MaxAngleDelay; // 0xdf1c(0x04)
	float RotateMinThreshold; // 0xdf20(0x04)
	float RotateMaxThreshold; // 0xdf24(0x04)
	struct FTurnInPlace_Asset N_TurnIP_L90; // 0xdf28(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R90; // 0xdf48(0x20)
	struct FTurnInPlace_Asset N_TurnIP_L180; // 0xdf68(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R180; // 0xdf88(0x20)
	float AimYawRateMinRange; // 0xdfa8(0x04)
	float AimYawRateMaxRange; // 0xdfac(0x04)
	float MinPlayRate; // 0xdfb0(0x04)
	float MaxPlayRate; // 0xdfb4(0x04)
	struct FTurnInPlace_Asset CLF_TurnIP_L90; // 0xdfb8(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R90; // 0xdfd8(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_L180; // 0xdff8(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R180; // 0xe018(0x20)
	float FlailRate; // 0xe038(0x04)
	float Enable_HandIK_L; // 0xe03c(0x04)
	float Enable_HandIK_R; // 0xe040(0x04)
	float AnimatedWalkSpeed; // 0xe044(0x04)
	float AnimatedRunSpeed; // 0xe048(0x04)
	float AnimatedSprintSpeed; // 0xe04c(0x04)
	float AnimatedCrouchSpeed; // 0xe050(0x04)
	float VelocityBlendInterpSpeed; // 0xe054(0x04)
	float GroundedLeanInterpSpeed; // 0xe058(0x04)
	float InAirLeanInterpSpeed; // 0xe05c(0x04)
	float SmoothedAimingRotationInterpSpeed; // 0xe060(0x04)
	float InputYawOffsetInterpSpeed; // 0xe064(0x04)
	float TriggerPivotSpeedLimit; // 0xe068(0x04)
	float FootHeight; // 0xe06c(0x04)
	float IK_TraceDistanceAboveFoot; // 0xe070(0x04)
	float IK_TraceDistanceBelowFoot; // 0xe074(0x04)
	float BlendSpine; // 0xe078(0x04)
	float BaseCrawl; // 0xe07c(0x04)
	enum class ALS_State ALS_State; // 0xe080(0x01)
	char pad_E081[0x3]; // 0xe081(0x03)
	float BaseArmLBlend; // 0xe084(0x04)
	float BaseArmRBlend; // 0xe088(0x04)
	float BaseArmR_Blend; // 0xe08c(0x04)
	enum class Als_AimState Aim_state; // 0xe090(0x01)
	bool IsMan; // 0xe091(0x01)
	char pad_E092[0x2]; // 0xe092(0x02)
	float Leg_add; // 0xe094(0x04)
	struct FRotator Foot L Last Rotation; // 0xe098(0x0c)
	struct FRotator Foot; // 0xe0a4(0x0c)
	bool Isdead; // 0xe0b0(0x01)
	bool modifyflash; // 0xe0b1(0x01)
	enum class E_PlayerActionType ActionType; // 0xe0b2(0x01)
	char pad_E0B3[0x1]; // 0xe0b3(0x01)
	struct FRotator RotationZ; // 0xe0b4(0x0c)
	bool isright; // 0xe0c0(0x01)
	bool ispiskill; // 0xe0c1(0x01)
	char pad_E0C2[0x6]; // 0xe0c2(0x06)
	struct UAudioComponent* walkvoice; // 0xe0c8(0x08)

	void BPI_GetState(enum class MovementDirection MoveDirection, float Offset); // Function ABP_Niexiaoqian.ABP_Niexiaoqian_C.BPI_GetState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void woman(Cycle Blend)(struct FPoseLink wF, struct FPoseLink wb, struct FPoseLink WLB, struct FPoseLink WLF, struct FPoseLink wrb, struct FPoseLink WRF, struct FPoseLink Wsprint, struct FPoseLink woman(Cycle Blend)); // Function ABP_Niexiaoqian.ABP_Niexiaoqian_C.woman(Cycle Blend) // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void BaseBlend(struct FPoseLink Base, struct FPoseLink BaseBlend); // Function ABP_Niexiaoqian.ABP_Niexiaoqian_C.BaseBlend // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
