// AnimBlueprintGeneratedClass ABP_JH_Cloth_S_WB_Skin.ABP_JH_Cloth_S_WB_Skin_C
// Size: 0x2c10 (Inherited: 0x2c0)
struct UABP_JH_Cloth_S_WB_Skin_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8(0x1d8)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_16; // 0x4d0(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_15; // 0x740(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_14; // 0x9b0(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_13; // 0xc20(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_12; // 0xe90(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_11; // 0x1100(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_10; // 0x1370(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_9; // 0x15e0(0x270)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1850(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1870(0x20)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_8; // 0x1890(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7; // 0x1b00(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0x1d70(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0x1fe0(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0x2250(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0x24c0(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0x2730(0x270)
	struct FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x29a0(0x270)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_JH_Cloth_S_WB_Skin.ABP_JH_Cloth_S_WB_Skin_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void ExecuteUbergraph_ABP_JH_Cloth_S_WB_Skin(int32_t EntryPoint); // Function ABP_JH_Cloth_S_WB_Skin.ABP_JH_Cloth_S_WB_Skin_C.ExecuteUbergraph_ABP_JH_Cloth_S_WB_Skin // (Final|UbergraphFunction) // @ game+0x1ec38f0
};

