// AnimBlueprintGeneratedClass ABP_Camr.ABP_Camr_C
// Size: 0x2251 (Inherited: 0x2c0)
struct UABP_Camr_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24; // 0x2c8(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23; // 0x320(0x58)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x378(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x428(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22; // 0x4d8(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21; // 0x530(0x58)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x5b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x5d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x808(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x830(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x858(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x8a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x8d0(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20; // 0x8f8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x950(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19; // 0x980(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x9d8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18; // 0xa08(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xa60(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17; // 0xa90(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xae8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16; // 0xb18(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xb70(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15; // 0xba0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xbf8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14; // 0xc28(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xc80(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13; // 0xcb0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd08(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12; // 0xd38(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd90(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11; // 0xdc0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xe18(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xe48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xe70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xe98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xec0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xee8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xf10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xf38(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10; // 0xf60(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xfb8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9; // 0xfe8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1040(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8; // 0x1070(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x10c8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x10f8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1120(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1150(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1200(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1230(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x12e0(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7; // 0x1390(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x13e8(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x1540(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6; // 0x15f0(0x58)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1648(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x16f8(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0x17a8(0x58)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1800(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0x18b0(0x58)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1908(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_6; // 0x19a8(0xa0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0x1a48(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0x1aa0(0x58)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1af8(0x30)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_5; // 0x1b28(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_4; // 0x1bc8(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_3; // 0x1c68(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1d08(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1e60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1e88(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x1eb0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1f08(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1f38(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1f60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1f90(0xb0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_2; // 0x2040(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x20e0(0xa0)
	enum class ECameraOverlapType __CustomProperty_Camera Overlap Type_616E652B47000C8DA132BDAFE59E07CC; // 0x2180(0x01)
	enum class MovementDirection __CustomProperty_Movedirection_616E652B47000C8DA132BDAFE59E07CC; // 0x2181(0x01)
	enum class ECameraType __CustomProperty_Camerastate_616E652B47000C8DA132BDAFE59E07CC; // 0x2182(0x01)
	enum class Als_AimState __CustomProperty_Aim State_616E652B47000C8DA132BDAFE59E07CC; // 0x2183(0x01)
	enum class ALS_State __CustomProperty_Injured_616E652B47000C8DA132BDAFE59E07CC; // 0x2184(0x01)
	enum class ALS_OverlayState __CustomProperty_Overlay State_616E652B47000C8DA132BDAFE59E07CC; // 0x2185(0x01)
	enum class ALS_ViewMode __CustomProperty_View Mode_616E652B47000C8DA132BDAFE59E07CC; // 0x2186(0x01)
	enum class ALS_Stance __CustomProperty_Actual Stance_616E652B47000C8DA132BDAFE59E07CC; // 0x2187(0x01)
	enum class ALS_Gait __CustomProperty_Actual Gait_616E652B47000C8DA132BDAFE59E07CC; // 0x2188(0x01)
	enum class ALS_RotationMode __CustomProperty_Rotation Mode_616E652B47000C8DA132BDAFE59E07CC; // 0x2189(0x01)
	enum class ALS_MovementAction __CustomProperty_Movement Action_616E652B47000C8DA132BDAFE59E07CC; // 0x218a(0x01)
	enum class ALS_MovementState __CustomProperty_Movement State_616E652B47000C8DA132BDAFE59E07CC; // 0x218b(0x01)
	enum class ECameraOverlapType __CustomProperty_Camera Overlap Type_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x218c(0x01)
	enum class MovementDirection __CustomProperty_Movedirection_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x218d(0x01)
	enum class ECameraType __CustomProperty_Camerastate_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x218e(0x01)
	enum class Als_AimState __CustomProperty_Aim State_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x218f(0x01)
	enum class ALS_State __CustomProperty_Injured_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2190(0x01)
	enum class ALS_OverlayState __CustomProperty_Overlay State_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2191(0x01)
	enum class ALS_ViewMode __CustomProperty_View Mode_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2192(0x01)
	enum class ALS_Stance __CustomProperty_Actual Stance_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2193(0x01)
	enum class ALS_Gait __CustomProperty_Actual Gait_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2194(0x01)
	enum class ALS_RotationMode __CustomProperty_Rotation Mode_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2195(0x01)
	enum class ALS_MovementAction __CustomProperty_Movement Action_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2196(0x01)
	enum class ALS_MovementState __CustomProperty_Movement State_CD9D64DC42300D6FA39EF1B3F67F8951; // 0x2197(0x01)
	enum class ECameraOverlapType __CustomProperty_Camera Overlap Type_2E08D2A0415291FF1951CB8BB595FFA0; // 0x2198(0x01)
	enum class MovementDirection __CustomProperty_Movedirection_2E08D2A0415291FF1951CB8BB595FFA0; // 0x2199(0x01)
	enum class ECameraType __CustomProperty_Camerastate_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219a(0x01)
	enum class Als_AimState __CustomProperty_Aim State_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219b(0x01)
	enum class ALS_State __CustomProperty_Injured_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219c(0x01)
	enum class ALS_OverlayState __CustomProperty_Overlay State_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219d(0x01)
	enum class ALS_ViewMode __CustomProperty_View Mode_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219e(0x01)
	enum class ALS_Stance __CustomProperty_Actual Stance_2E08D2A0415291FF1951CB8BB595FFA0; // 0x219f(0x01)
	enum class ALS_Gait __CustomProperty_Actual Gait_2E08D2A0415291FF1951CB8BB595FFA0; // 0x21a0(0x01)
	enum class ALS_RotationMode __CustomProperty_Rotation Mode_2E08D2A0415291FF1951CB8BB595FFA0; // 0x21a1(0x01)
	enum class ALS_MovementAction __CustomProperty_Movement Action_2E08D2A0415291FF1951CB8BB595FFA0; // 0x21a2(0x01)
	enum class ALS_MovementState __CustomProperty_Movement State_2E08D2A0415291FF1951CB8BB595FFA0; // 0x21a3(0x01)
	enum class ECameraOverlapType __CustomProperty_Camera Overlap Type_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a4(0x01)
	enum class MovementDirection __CustomProperty_Movedirection_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a5(0x01)
	enum class ECameraType __CustomProperty_Camerastate_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a6(0x01)
	enum class Als_AimState __CustomProperty_Aim State_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a7(0x01)
	enum class ALS_State __CustomProperty_Injured_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a8(0x01)
	enum class ALS_OverlayState __CustomProperty_Overlay State_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21a9(0x01)
	enum class ALS_ViewMode __CustomProperty_View Mode_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21aa(0x01)
	enum class ALS_Stance __CustomProperty_Actual Stance_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21ab(0x01)
	enum class ALS_Gait __CustomProperty_Actual Gait_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21ac(0x01)
	enum class ALS_RotationMode __CustomProperty_Rotation Mode_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21ad(0x01)
	enum class ALS_MovementAction __CustomProperty_Movement Action_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21ae(0x01)
	enum class ALS_MovementState __CustomProperty_Movement State_89E6F2F641F784A7DE129EBE432FEA3B; // 0x21af(0x01)
	struct APawn* __CustomProperty_ControlPawn_617989C44DC5B6A34E54C9BC2702DDA7; // 0x21b0(0x08)
	struct APawn* __CustomProperty_ControlPawn_B01E5E424EA340711A85FBA70361860E; // 0x21b8(0x08)
	struct APawn* ControlPawn; // 0x21c0(0x08)
	enum class ALS_MovementState Movement State; // 0x21c8(0x01)
	enum class ALS_MovementAction Movement Action; // 0x21c9(0x01)
	enum class ALS_RotationMode Rotation mode; // 0x21ca(0x01)
	enum class ALS_Gait Actual Gait; // 0x21cb(0x01)
	enum class ALS_Stance Actual Stance; // 0x21cc(0x01)
	enum class ALS_ViewMode View Mode; // 0x21cd(0x01)
	enum class ALS_OverlayState Overlay State; // 0x21ce(0x01)
	enum class ALS_State Injured; // 0x21cf(0x01)
	enum class Als_AimState Aim State; // 0x21d0(0x01)
	bool Is Moving; // 0x21d1(0x01)
	enum class ECameraType Camerastate; // 0x21d2(0x01)
	enum class MovementDirection MoveDirection; // 0x21d3(0x01)
	float Offset; // 0x21d4(0x04)
	enum class ECameraOverlapType Camera Overlap Type; // 0x21d8(0x01)
	char pad_21D9[0x3]; // 0x21d9(0x03)
	int32_t Anim Int; // 0x21dc(0x04)
	struct FCamraSetingData CameraData; // 0x21e0(0x60)
	struct TArray<float> Data; // 0x2240(0x10)
	bool New Camera Setting; // 0x2250(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_Camr.ABP_Camr_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void GetCharacterInfo(); // Function ABP_Camr.ABP_Camr_C.GetCharacterInfo // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camr_AnimGraphNode_TransitionResult_394F82C04100A05FA678BC91D6ECE2C2(); // Function ABP_Camr.ABP_Camr_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camr_AnimGraphNode_TransitionResult_394F82C04100A05FA678BC91D6ECE2C2 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camr_AnimGraphNode_ModifyCurve_804F8DAF4E5A7AE5CEB2539BA0F0E01D(); // Function ABP_Camr.ABP_Camr_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Camr_AnimGraphNode_ModifyCurve_804F8DAF4E5A7AE5CEB2539BA0F0E01D // (BlueprintEvent) // @ game+0x1ec38f0
