// AnimBlueprintGeneratedClass ABP_SZ.ABP_SZ_C
// Size: 0xf984 (Inherited: 0x2c0)
struct UABP_SZ_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x2c8(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0x390(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0x3b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0x3e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0x538(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x560(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x5b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x5d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x6c8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_27; // 0x6f0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0x748(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0x770(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0x798(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0x7c0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_18; // 0x7e8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x838(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_26; // 0x868(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0x8c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0x8e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0x910(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0x938(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_17; // 0x960(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x9b0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_25; // 0x9e0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0xa38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0xa60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0xa88(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_16; // 0xab0(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0xb00(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0xb28(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24; // 0xb58(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0xbb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0xbd8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0xc00(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_15; // 0xc28(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0xc78(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0xca0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23; // 0xcd0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0xd28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0xd50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0xd78(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_14; // 0xda0(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0xdf0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0xe18(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22; // 0xe48(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0xea0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0xec8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0xef0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_13; // 0xf18(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0xf68(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0xf90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0xfc0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x1070(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x1120(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_19; // 0x1150(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0x1268(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x13c0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x13e8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x1430(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x1588(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x15b0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x15d8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x1698(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x16c0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x1708(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x1860(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x1888(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0x18d0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x1a28(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x1a50(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x1a98(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x1bf0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x1cb0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x1d70(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x1e30(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x1e58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x1e80(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x1ea8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x2000(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x2158(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x22b0(0x158)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x2408(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x2438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x2460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x2488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x24b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x24d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x2500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x2528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x2550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x2578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x25a0(0x28)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_5; // 0x25c8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x26b8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_4; // 0x26e8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x27d8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x2808(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x28f8(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x2928(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x2a18(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x2a48(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x2b38(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x2b68(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x2c18(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x2c48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x2c70(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x2c98(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x2ce8(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x2d18(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x2d68(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x2d98(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x2e48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x2e78(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x2f28(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_18; // 0x2f58(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x3070(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x3090(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x3198(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x32a0(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x3480(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x3660(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x3768(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x3870(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x3890(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x3998(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x3aa0(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3ba8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_17; // 0x3bd8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16; // 0x3cf0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15; // 0x3e08(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14; // 0x3f20(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13; // 0x4038(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12; // 0x4150(0x118)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x4268(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x4290(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x42b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x42e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x4308(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x4330(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x4358(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x4380(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21; // 0x43a8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x4400(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x4428(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x4450(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x4478(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_12; // 0x44a0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x44f0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20; // 0x4520(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x4578(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x45a0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_11; // 0x45c8(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x4618(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x4640(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x4668(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19; // 0x4698(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x46f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x4718(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_10; // 0x4740(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x4790(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x47b8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x47e0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18; // 0x4810(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x4868(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x4890(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x48b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x48e0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_9; // 0x4908(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4958(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x4988(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x49b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x49d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x4a00(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17; // 0x4a28(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_8; // 0x4a80(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x4ad0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x4b00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x4b28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x4b50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x4b78(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16; // 0x4ba0(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_7; // 0x4bf8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x4c48(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x4c78(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x4d28(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x4e80(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x4fd8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x5130(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x5288(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x53e0(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11; // 0x5538(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x5650(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x57a8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x5900(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x5928(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10; // 0x5a80(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9; // 0x5b98(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x5cb0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x5dc8(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x5ee0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x5f10(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x6028(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x6140(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x6298(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x63f0(0x158)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x6548(0x38)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x6580(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x65b8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x6710(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x6868(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x6890(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x68b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x68e0(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x6908(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x69d8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x6aa0(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x6ae8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x6c40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x6c68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x6c90(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x6cb8(0xc0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0x6d78(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x6e48(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x6f10(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x6f58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x6f80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x6fa8(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x6fd0(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x70a0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x7168(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x71b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x71d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x7200(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x7228(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x72f8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x73c0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x7408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x7430(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x7458(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x7480(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x7548(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x7590(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x75b8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x75e0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x76a8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x76f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x7718(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x7740(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x7898(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x79f0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x7b48(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7ca0(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x7df8(0x118)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x7f10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x7f38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7f60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7f88(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x7fb0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x8078(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x8140(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x8200(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x82c0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x8380(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x83a8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x8468(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x8528(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x8550(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x8610(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x86d0(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x8718(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x87d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x8800(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x8828(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x8850(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x8878(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x88a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x88c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x88f0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x8918(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x89d8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x8a08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x8a30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x8a58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x8a80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x8aa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x8ad0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x8af8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x8b20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x8b48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x8b70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x8b98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x8bc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x8be8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x8c10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x8c38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x8c60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x8c88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x8cb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x8cd8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15; // 0x8d00(0x58)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x8d58(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x8e28(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x8ef0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x8f70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x8ff0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x9020(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x9048(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14; // 0x9070(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x90c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x9190(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x9210(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x9290(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13; // 0x92c0(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x9318(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x93e0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x9430(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x9480(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x9548(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x9610(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x96f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x9720(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x9748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x9770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x9798(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x97c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x9840(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x9870(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x98f0(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x9920(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x99e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x9a68(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x9ae8(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x9b18(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x9be0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x9c60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x9ce0(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x9d10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x9d40(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x9df0(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x9e20(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x9ee8(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x9fd0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0xa098(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0xa0e8(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xa138(0xc8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12; // 0xa200(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xa258(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xa320(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xa3a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xa420(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xa4a0(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0xa568(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xa598(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11; // 0xa5c0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0xa618(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0xa648(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xa6f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xa720(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10; // 0xa748(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0xa7a0(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xa7d0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0xa800(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xa8b0(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xa998(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0xaa60(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xaae0(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0xab90(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0xac40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xacc0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xad40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xadc0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xae40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xaec0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xaf40(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0xafc0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0xaff0(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xb0a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xb0c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xb0f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xb118(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xb140(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xb168(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xb190(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xb1b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xb1e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xb208(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xb230(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xb258(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xb280(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xb2a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xb328(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xb3a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xb428(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_6; // 0xb4a8(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xb4f8(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xb5c0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xb5f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xb618(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xb640(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xb6c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xb740(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xb7c0(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_5; // 0xb840(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xb890(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xb958(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xb988(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xb9b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xba30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xbab0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xbb30(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_4; // 0xbbb0(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xbc00(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xbcc8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xbcf8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xbd20(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xbd50(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xbd78(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xbda8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xbdd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xbe50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xbed0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xbf50(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_3; // 0xbfd0(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xc020(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xc0e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xc118(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xc1c8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xc210(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xc368(0x158)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xc4c0(0x70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xc530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xc558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xc580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xc5a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xc5d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xc5f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xc620(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xc648(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xc670(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9; // 0xc6f0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xc748(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xc778(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8; // 0xc7f8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xc850(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xc880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xc8a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xc8d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xc8f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xc920(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xc948(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0xc970(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0xc9c0(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xca10(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0xcac0(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xcb10(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0xcbc0(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_2; // 0xcc10(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0xcc60(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xccb0(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xcd00(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7; // 0xcdc0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xce18(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xce48(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xce70(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xcec0(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xcf10(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xcfc0(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xd010(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xd0c0(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend; // 0xd110(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0xd160(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xd1b0(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xd200(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6; // 0xd2c0(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd318(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0xd348(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xd3a0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xd3c8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0xd3f8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xd450(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xd478(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xd4a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xd4d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xd4f8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xd520(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xd550(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xd600(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xd630(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xd658(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xd688(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0xd708(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0xd760(0x48)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0xd7a8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xd800(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xd830(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xd8e0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xda38(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xdb90(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xdbd8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0xdc08(0x118)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xdd20(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xdd40(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xdd60(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xdeb8(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xe010(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xe0c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe0e8(0x28)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xe110(0x90)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xe1a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xe1d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xe250(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xe280(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xe330(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xe438(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xe540(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xe648(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xe750(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xe778(0x20)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe798(0xc8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xe860(0x20)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0xe880(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0xe930(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xea00(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0xea28(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0xead8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xeb88(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xece0(0x108)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xede8(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xee98(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xeef0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xf048(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xf070(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xf110(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xf138(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0xf180(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xf298(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xf3b0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xf3e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xf428(0x48)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0xf470(0xd0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xf540(0x50)
	struct FRotator AimingRotation; // 0xf590(0x0c)
	struct FVector Velocity; // 0xf59c(0x0c)
	struct FVector RelativeVelocityDirection; // 0xf5a8(0x0c)
	struct FVector Acceleration; // 0xf5b4(0x0c)
	struct FVector MovementInput; // 0xf5c0(0x0c)
	bool IsMoving; // 0xf5cc(0x01)
	bool HasMovementInput; // 0xf5cd(0x01)
	char pad_F5CE[0x2]; // 0xf5ce(0x02)
	float Speed; // 0xf5d0(0x04)
	float MovementInputAmount; // 0xf5d4(0x04)
	enum class GroundedEntryState GroundedEntryState; // 0xf5d8(0x01)
	enum class MovementDirection MovementDirection; // 0xf5d9(0x01)
	enum class HipsDirection TrackedHipsDirection; // 0xf5da(0x01)
	char pad_F5DB[0x1]; // 0xf5db(0x01)
	struct FVector RelativeAccelerationAmount; // 0xf5dc(0x0c)
	bool ShouldMove; // 0xf5e8(0x01)
	bool Rotate_L; // 0xf5e9(0x01)
	bool Rotate_R; // 0xf5ea(0x01)
	bool Pivot; // 0xf5eb(0x01)
	float RotateRate; // 0xf5ec(0x04)
	float RotationScale; // 0xf5f0(0x04)
	float DiagonalScaleAmount; // 0xf5f4(0x04)
	float WalkRunBlend; // 0xf5f8(0x04)
	float StandingPlayRate; // 0xf5fc(0x04)
	float CrouchingPlayRate; // 0xf600(0x04)
	float StrideBlend; // 0xf604(0x04)
	struct FVelocityBlend VelocityBlend; // 0xf608(0x10)
	struct FLeanAmount LeanAmount; // 0xf618(0x08)
	struct UCurveFloat* DiagonalScaleAmountCurve; // 0xf620(0x08)
	struct UCurveFloat* StrideBlend_N_Walk; // 0xf628(0x08)
	struct UCurveFloat* StrideBlend_N_Run; // 0xf630(0x08)
	struct UCurveFloat* StrideBlend_C_Walk; // 0xf638(0x08)
	struct FRotator SmoothedAimingRotation; // 0xf640(0x0c)
	struct FRotator SpineRotation; // 0xf64c(0x0c)
	struct FVector2D AimingAngle; // 0xf658(0x08)
	struct FVector2D SmoothedAimingAngle; // 0xf660(0x08)
	float AimSweepTime; // 0xf668(0x04)
	float AimYawRate; // 0xf66c(0x04)
	float ZoomAmount; // 0xf670(0x04)
	bool Jumped; // 0xf674(0x01)
	char pad_F675[0x3]; // 0xf675(0x03)
	float JumpPlayRate; // 0xf678(0x04)
	float FallSpeed; // 0xf67c(0x04)
	float LandPrediction; // 0xf680(0x04)
	char pad_F684[0x4]; // 0xf684(0x04)
	struct UCurveFloat* LandPredictionCurve; // 0xf688(0x08)
	struct UCurveFloat* LeanInAirCurve; // 0xf690(0x08)
	int32_t OverlayOverrideState; // 0xf698(0x04)
	float Enable_AimOffset; // 0xf69c(0x04)
	float FootLock_L_Alpha; // 0xf6a0(0x04)
	float FootLock_R_Alpha; // 0xf6a4(0x04)
	struct FVector FootLock_L_Location; // 0xf6a8(0x0c)
	struct FVector FootLock_R_Location; // 0xf6b4(0x0c)
	struct FRotator FootLock_L_Rotation; // 0xf6c0(0x0c)
	struct FRotator FootLock_R_Rotation; // 0xf6cc(0x0c)
	struct FVector FootOffset_L_Location; // 0xf6d8(0x0c)
	struct FVector FootOffset_R_Location; // 0xf6e4(0x0c)
	struct FRotator FootOffset_L_Rotation; // 0xf6f0(0x0c)
	struct FRotator FootOffset_R_Rotation; // 0xf6fc(0x0c)
	struct FVector PelvisOffset; // 0xf708(0x0c)
	float PelvisAlpha; // 0xf714(0x04)
	struct ACharacter* Character; // 0xf718(0x08)
	float DeltaTimeX; // 0xf720(0x04)
	float TurnCheckMinAngle; // 0xf724(0x04)
	float Turn180Threshold; // 0xf728(0x04)
	float AimYawRateLimit; // 0xf72c(0x04)
	float ElapsedDelayTime; // 0xf730(0x04)
	enum class ALS_MovementState MovementState; // 0xf734(0x01)
	enum class ALS_MovementAction MovementAction; // 0xf735(0x01)
	enum class ALS_RotationMode RotationMode; // 0xf736(0x01)
	enum class ALS_Gait Gait; // 0xf737(0x01)
	enum class ALS_Stance Stance; // 0xf738(0x01)
	enum class ALS_ViewMode ViewMode; // 0xf739(0x01)
	enum class ALS_OverlayState overlaystate; // 0xf73a(0x01)
	char pad_F73B[0x1]; // 0xf73b(0x01)
	float BasePose_N; // 0xf73c(0x04)
	float BasePose_CLF; // 0xf740(0x04)
	float Arm_L; // 0xf744(0x04)
	float Arm_L_Add; // 0xf748(0x04)
	float Arm_L_LS; // 0xf74c(0x04)
	float Arm_L_MS; // 0xf750(0x04)
	float Arm_R; // 0xf754(0x04)
	float Arm_R_Add; // 0xf758(0x04)
	float Arm_R_LS; // 0xf75c(0x04)
	float Arm_R_MS; // 0xf760(0x04)
	float hand_l; // 0xf764(0x04)
	float hand_r; // 0xf768(0x04)
	float Legs; // 0xf76c(0x04)
	float Legs_Add; // 0xf770(0x04)
	float pelvis; // 0xf774(0x04)
	float Pelvis_Add; // 0xf778(0x04)
	float Spine; // 0xf77c(0x04)
	float Spine_Add; // 0xf780(0x04)
	float head; // 0xf784(0x04)
	float Head_Add; // 0xf788(0x04)
	char pad_F78C[0x4]; // 0xf78c(0x04)
	struct UCurveVector* YawOffset_FB; // 0xf790(0x08)
	struct UCurveVector* YawOffset_LR; // 0xf798(0x08)
	float FYaw; // 0xf7a0(0x04)
	float BYaw; // 0xf7a4(0x04)
	float LYaw; // 0xf7a8(0x04)
	float RYaw; // 0xf7ac(0x04)
	float InputYawOffsetTime; // 0xf7b0(0x04)
	float ForwardYawTime; // 0xf7b4(0x04)
	float LeftYawTime; // 0xf7b8(0x04)
	float RightYawTime; // 0xf7bc(0x04)
	float MinAngleDelay; // 0xf7c0(0x04)
	float MaxAngleDelay; // 0xf7c4(0x04)
	float RotateMinThreshold; // 0xf7c8(0x04)
	float RotateMaxThreshold; // 0xf7cc(0x04)
	struct FTurnInPlace_Asset N_TurnIP_L90; // 0xf7d0(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R90; // 0xf7f0(0x20)
	struct FTurnInPlace_Asset N_TurnIP_L180; // 0xf810(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R180; // 0xf830(0x20)
	float AimYawRateMinRange; // 0xf850(0x04)
	float AimYawRateMaxRange; // 0xf854(0x04)
	float MinPlayRate; // 0xf858(0x04)
	float MaxPlayRate; // 0xf85c(0x04)
	struct FTurnInPlace_Asset CLF_TurnIP_L90; // 0xf860(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R90; // 0xf880(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_L180; // 0xf8a0(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R180; // 0xf8c0(0x20)
	float FlailRate; // 0xf8e0(0x04)
	float Enable_HandIK_L; // 0xf8e4(0x04)
	float Enable_HandIK_R; // 0xf8e8(0x04)
	float AnimatedWalkSpeed; // 0xf8ec(0x04)
	float AnimatedRunSpeed; // 0xf8f0(0x04)
	float AnimatedSprintSpeed; // 0xf8f4(0x04)
	float AnimatedCrouchSpeed; // 0xf8f8(0x04)
	float VelocityBlendInterpSpeed; // 0xf8fc(0x04)
	float GroundedLeanInterpSpeed; // 0xf900(0x04)
	float InAirLeanInterpSpeed; // 0xf904(0x04)
	float SmoothedAimingRotationInterpSpeed; // 0xf908(0x04)
	float InputYawOffsetInterpSpeed; // 0xf90c(0x04)
	float TriggerPivotSpeedLimit; // 0xf910(0x04)
	float FootHeight; // 0xf914(0x04)
	float IK_TraceDistanceAboveFoot; // 0xf918(0x04)
	float IK_TraceDistanceBelowFoot; // 0xf91c(0x04)
	float BlendSpine; // 0xf920(0x04)
	float BaseCrawl; // 0xf924(0x04)
	enum class ALS_State ALS_State; // 0xf928(0x01)
	char pad_F929[0x3]; // 0xf929(0x03)
	float BaseArmLBlend; // 0xf92c(0x04)
	float BaseArmRBlend; // 0xf930(0x04)
	float BaseArmR_Blend; // 0xf934(0x04)
	enum class Als_AimState Aim_state; // 0xf938(0x01)
	bool IsMan; // 0xf939(0x01)
	char pad_F93A[0x2]; // 0xf93a(0x02)
	float Leg_add; // 0xf93c(0x04)
	struct FRotator Foot L Last Rotation; // 0xf940(0x0c)
	struct FRotator Foot; // 0xf94c(0x0c)
	bool Isdead; // 0xf958(0x01)
	bool modifyflash; // 0xf959(0x01)
	enum class E_PlayerActionType ActionType; // 0xf95a(0x01)
	char pad_F95B[0x1]; // 0xf95b(0x01)
	struct FRotator RotationZ; // 0xf95c(0x0c)
	bool isright; // 0xf968(0x01)
	bool ispiskill; // 0xf969(0x01)
	char pad_F96A[0x2]; // 0xf96a(0x02)
	float BlendSp; // 0xf96c(0x04)
	float addtivespine; // 0xf970(0x04)
	float Alpha; // 0xf974(0x04)
	bool Enabled; // 0xf978(0x01)
	char pad_F979[0x3]; // 0xf979(0x03)
	float DisabelFullbody; // 0xf97c(0x04)
	float AddtiveAim; // 0xf980(0x04)

	void BPI_GetState(enum class MovementDirection MoveDirection, float Offset); // Function ABP_SZ.ABP_SZ_C.BPI_GetState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void woman(Cycle Blend)(struct FPoseLink wF, struct FPoseLink wb, struct FPoseLink WLB, struct FPoseLink WLF, struct FPoseLink wrb, struct FPoseLink WRF, struct FPoseLink Wsprint, struct FPoseLink woman(Cycle Blend)); // Function ABP_SZ.ABP_SZ_C.woman(Cycle Blend) // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void BaseBlend(struct FPoseLink Base, struct FPoseLink BaseBlend); // Function ABP_SZ.ABP_SZ_C.BaseBlend // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AimOffsetBehaviors(struct FPoseLink AimOffsetBehaviors); // Function ABP_SZ.ABP_SZ_C.AimOffsetBehaviors // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
