// AnimBlueprintGeneratedClass BianDreesRoom.BianDreesRoom_C
// Size: 0x25d9 (Inherited: 0x2c0)
struct UBianDreesRoom_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_4; // 0x2c8(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_3; // 0x3f0(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_2; // 0x518(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x640(0x20)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone; // 0x660(0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x788(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x8a0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x9f8(0x158)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xb50(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xbf0(0x158)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xd48(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0xd78(0x58)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xdd0(0xc8)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0xe98(0x38)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xed0(0x50)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xf20(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfa0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xfc0(0x108)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x10c8(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1190(0x50)
	struct FAnimNode_ModifyMapCurve AnimGraphNode_ModifyMapCurve; // 0x11e0(0x98)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_3; // 0x1278(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1318(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1338(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1440(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x14c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1540(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x15c0(0x80)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1668(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0x1690(0x58)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x16e8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1768(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1830(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x18b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x18e0(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1960(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1a28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1aa8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ad8(0xb0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x1b88(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1ca0(0x20)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0x1cc0(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0x1d18(0x58)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_2; // 0x1d70(0xa0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1e10(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1f28(0x30)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1f58(0xa0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x1ff8(0x58)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x2050(0x368)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x23b8(0xa0)
	bool __CustomProperty_isjuwai_8702E3344FAA1DDEBC185FAC37FB67EB; // 0x2458(0x01)
	bool __CustomProperty_isman_8702E3344FAA1DDEBC185FAC37FB67EB; // 0x2459(0x01)
	bool __CustomProperty_isautonamous_8702E3344FAA1DDEBC185FAC37FB67EB; // 0x245a(0x01)
	char pad_245B[0x1]; // 0x245b(0x01)
	struct FLiveLinkSubjectName __CustomProperty_DeviceName_8702E3344FAA1DDEBC185FAC37FB67EB; // 0x245c(0x08)
	int32_t Active Child Index; // 0x2464(0x04)
	int32_t randominit; // 0x2468(0x04)
	struct FLiveLinkSubjectName Live Link Subject Name; // 0x246c(0x08)
	struct FCalibrationOffset caliboffset; // 0x2474(0xd8)
	int32_t Shoe ID; // 0x254c(0x04)
	bool Enabled; // 0x2550(0x01)
	char pad_2551[0x7]; // 0x2551(0x07)
	struct UAnimSequenceBase* Sequence; // 0x2558(0x08)
	struct TMap<struct FName, float> Curve Map Values; // 0x2560(0x50)
	int32_t ID; // 0x25b0(0x04)
	bool istoidle; // 0x25b4(0x01)
	bool Enabledbreast; // 0x25b5(0x01)
	bool tostand; // 0x25b6(0x01)
	char pad_25B7[0x1]; // 0x25b7(0x01)
	float Blend Biaoqing; // 0x25b8(0x04)
	char pad_25BC[0x4]; // 0x25bc(0x04)
	struct UAnimSequenceBase* standsequece; // 0x25c0(0x08)
	struct UAnimSequenceBase* biaoqingsequence; // 0x25c8(0x08)
	struct UAnimSequenceBase* idiesequece; // 0x25d0(0x08)
	bool isautonamous; // 0x25d8(0x01)

	void biaoqing(struct FPoseLink InPose_1, struct FPoseLink biaoqing); // Function BianDreesRoom.BianDreesRoom_C.biaoqing // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimGraph(struct FPoseLink InPose, struct FPoseLink InPose_2, struct FPoseLink AnimGraph); // Function BianDreesRoom.BianDreesRoom_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void Switch Nielian(int32_t Index, float Value); // Function BianDreesRoom.BianDreesRoom_C.Switch Nielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetDefaultNielian(); // Function BianDreesRoom.BianDreesRoom_C.SetDefaultNielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetNielian(int32_t ID); // Function BianDreesRoom.BianDreesRoom_C.SetNielian // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetGhost(bool IsGhost); // Function BianDreesRoom.BianDreesRoom_C.SetGhost // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyCurve_7C18E70B407127FCA48DB0A7F8C93643(); // Function BianDreesRoom.BianDreesRoom_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyCurve_7C18E70B407127FCA48DB0A7F8C93643 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyBone_544CC90D4E6AC1F4DB3257A747A6C8CE(); // Function BianDreesRoom.BianDreesRoom_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyBone_544CC90D4E6AC1F4DB3257A747A6C8CE // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyBone_CCF1FA9F443A3B056F18238BD9076D80(); // Function BianDreesRoom.BianDreesRoom_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyBone_CCF1FA9F443A3B056F18238BD9076D80 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyCurve_3AB560174D05F2E254FAE5BD5D2696DF(); // Function BianDreesRoom.BianDreesRoom_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BianDreesRoom_AnimGraphNode_ModifyCurve_3AB560174D05F2E254FAE5BD5D2696DF // (BlueprintEvent) // @ game+0x1ec38f0
	void BlueprintInitializeAnimation(); // Function BianDreesRoom.BianDreesRoom_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1ec38f0
	void setcharcterid(int32_t _CharacterID, int32_t _ShoeID); // Function BianDreesRoom.BianDreesRoom_C.setcharcterid // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void setHumanindex(int32_t humanindex); // Function BianDreesRoom.BianDreesRoom_C.setHumanindex // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_randomidle(); // Function BianDreesRoom.BianDreesRoom_C.AnimNotify_randomidle // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_randomstand(); // Function BianDreesRoom.BianDreesRoom_C.AnimNotify_randomstand // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_resetidle(); // Function BianDreesRoom.BianDreesRoom_C.AnimNotify_resetidle // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimNotify_tostand(); // Function BianDreesRoom.BianDreesRoom_C.AnimNotify_tostand // (BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetCharacterid(int32_t ConfigID); // Function BianDreesRoom.BianDreesRoom_C.SetCharacterid // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void SetLinkSubj(struct FLiveLinkSubjectName LinkName); // Function BianDreesRoom.BianDreesRoom_C.SetLinkSubj // (BlueprintEvent) // @ game+0x1ec38f0
	void ExecuteUbergraph_BianDreesRoom(int32_t EntryPoint); // Function BianDreesRoom.BianDreesRoom_C.ExecuteUbergraph_BianDreesRoom // (Final|UbergraphFunction|HasDefaults) // @ game+0x1ec38f0
};

