// BlueprintGeneratedClass BP_PlayerHumanBase.BP_PlayerHumanBase_C
// Size: 0x2f29 (Inherited: 0x1d60)
struct ABP_PlayerHumanBase_C : ANOS_PlayerHuman {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1d60(0x08)
	struct UPostProcessComponent* PostProcessLRS; // 0x1d68(0x08)
	struct UCapsuleComponent* PhysicsCollision; // 0x1d70(0x08)
	struct UPostProcessComponent* PostProcess; // 0x1d78(0x08)
	struct USceneCaptureComponent2D* SceneCaptureComponent2D; // 0x1d80(0x08)
	struct UWidgetComponent* Widget; // 0x1d88(0x08)
	struct UArrowComponent* Arrow1; // 0x1d90(0x08)
	float Timeline_TerritoryDebuff_Value_84A9EB2E4CD67164BBAFA698EB379E9F; // 0x1d98(0x04)
	enum class ETimelineDirection Timeline_TerritoryDebuff__Direction_84A9EB2E4CD67164BBAFA698EB379E9F; // 0x1d9c(0x01)
	char pad_1D9D[0x3]; // 0x1d9d(0x03)
	struct UTimelineComponent* Timeline_TerritoryDebuff; // 0x1da0(0x08)
	float bian_NewTrack_0_32594BD04E027DA3C3EFA7B4ADC4E220; // 0x1da8(0x04)
	enum class ETimelineDirection bian__Direction_32594BD04E027DA3C3EFA7B4ADC4E220; // 0x1dac(0x01)
	char pad_1DAD[0x3]; // 0x1dad(0x03)
	struct UTimelineComponent* bian; // 0x1db0(0x08)
	float Timeline_DeactiveObservedCamera_Alpha_D50CA4094128584ADA1BAC8F95FE3E5C; // 0x1db8(0x04)
	enum class ETimelineDirection Timeline_DeactiveObservedCamera__Direction_D50CA4094128584ADA1BAC8F95FE3E5C; // 0x1dbc(0x01)
	char pad_1DBD[0x3]; // 0x1dbd(0x03)
	struct UTimelineComponent* Timeline_DeactiveObservedCamera; // 0x1dc0(0x08)
	float InteractTurnTimeLine_NewTrack_0_5B4588CE4F76C5BBDD7675B3CD47C4FC; // 0x1dc8(0x04)
	enum class ETimelineDirection InteractTurnTimeLine__Direction_5B4588CE4F76C5BBDD7675B3CD47C4FC; // 0x1dcc(0x01)
	char pad_1DCD[0x3]; // 0x1dcd(0x03)
	struct UTimelineComponent* InteractTurnTimeLine; // 0x1dd0(0x08)
	float SteathTimeline_stealthlerp_EA1260BC4D5E051EA2FAC192B832610D; // 0x1dd8(0x04)
	enum class ETimelineDirection SteathTimeline__Direction_EA1260BC4D5E051EA2FAC192B832610D; // 0x1ddc(0x01)
	char pad_1DDD[0x3]; // 0x1ddd(0x03)
	struct UTimelineComponent* SteathTimeline; // 0x1de0(0x08)
	float AimCameraMove_Alpha_571E2E7E42222008B2D585B728401826; // 0x1de8(0x04)
	enum class ETimelineDirection AimCameraMove__Direction_571E2E7E42222008B2D585B728401826; // 0x1dec(0x01)
	char pad_1DED[0x3]; // 0x1ded(0x03)
	struct UTimelineComponent* AimCameraMove; // 0x1df0(0x08)
	float Valuttimeline_BlendCamera_2D5EF34248B90300C8C217AFEB344E71; // 0x1df8(0x04)
	float Valuttimeline_twoblendin_2D5EF34248B90300C8C217AFEB344E71; // 0x1dfc(0x04)
	float Valuttimeline_oneBlendin_2D5EF34248B90300C8C217AFEB344E71; // 0x1e00(0x04)
	enum class ETimelineDirection Valuttimeline__Direction_2D5EF34248B90300C8C217AFEB344E71; // 0x1e04(0x01)
	char pad_1E05[0x3]; // 0x1e05(0x03)
	struct UTimelineComponent* Valuttimeline; // 0x1e08(0x08)
	float CametaSwitch_lerpfloat_B126D55F431494D9B4F6578C9FDE6F53; // 0x1e10(0x04)
	enum class ETimelineDirection CametaSwitch__Direction_B126D55F431494D9B4F6578C9FDE6F53; // 0x1e14(0x01)
	char pad_1E15[0x3]; // 0x1e15(0x03)
	struct UTimelineComponent* CametaSwitch; // 0x1e18(0x08)
	float Timeline_0_NewTrack_0_21E4909149CAE3E87F8E05B34A99F0AD; // 0x1e20(0x04)
	enum class ETimelineDirection Timeline_0__Direction_21E4909149CAE3E87F8E05B34A99F0AD; // 0x1e24(0x01)
	char pad_1E25[0x3]; // 0x1e25(0x03)
	struct UTimelineComponent* Timeline_1; // 0x1e28(0x08)
	float Mantletineline_blendthree_99739B5143F5F6B1E1F279820A0DB761; // 0x1e30(0x04)
	float Mantletineline_Blendin_99739B5143F5F6B1E1F279820A0DB761; // 0x1e34(0x04)
	enum class ETimelineDirection Mantletineline__Direction_99739B5143F5F6B1E1F279820A0DB761; // 0x1e38(0x01)
	char pad_1E39[0x7]; // 0x1e39(0x07)
	struct UTimelineComponent* Mantletineline; // 0x1e40(0x08)
	float FlashlightAimingTimeline_Value_07A7692E4D6761458B3504B3C96B5B88; // 0x1e48(0x04)
	enum class ETimelineDirection FlashlightAimingTimeline__Direction_07A7692E4D6761458B3504B3C96B5B88; // 0x1e4c(0x01)
	char pad_1E4D[0x3]; // 0x1e4d(0x03)
	struct UTimelineComponent* FlashlightAimingTimeline; // 0x1e50(0x08)
	struct FLinearColor ElementColor; // 0x1e58(0x10)
	enum class ALS_MovementState MovementState; // 0x1e68(0x01)
	enum class ALS_MovementState PreviousMovementState; // 0x1e69(0x01)
	char pad_1E6A[0x2]; // 0x1e6a(0x02)
	struct FVector PreviousVelocity; // 0x1e6c(0x0c)
	float PreviousAimYaw; // 0x1e78(0x04)
	enum class NOS_GlideState GlideState; // 0x1e7c(0x01)
	char pad_1E7D[0x3]; // 0x1e7d(0x03)
	struct UKxInteractBoxComponent* InteractTarget; // 0x1e80(0x08)
	float InitialFOV; // 0x1e88(0x04)
	float AimingFOV; // 0x1e8c(0x04)
	struct FAls_HumanOverlapState OverlapState; // 0x1e90(0x02)
	char pad_1E92[0x2]; // 0x1e92(0x02)
	struct FMantle_TraceSettings Ground Trace Setting; // 0x1e94(0x14)
	struct FMantle_Params Mantleparams; // 0x1ea8(0x28)
	struct FALS_ComponentAndTransform Mantle Ledge Ls; // 0x1ed0(0x40)
	struct FTransform Mantle Target; // 0x1f10(0x30)
	struct FTransform Mantle actual Start Offset; // 0x1f40(0x30)
	struct FTransform mantle animated start offset; // 0x1f70(0x30)
	struct FMantle_Asset Mantle 2m Default; // 0x1fa0(0x38)
	struct FMantle_Asset Mnatle 1mdefault; // 0x1fd8(0x38)
	struct FTransform LerpTransform; // 0x2010(0x30)
	struct FTransform LastLerpTransform; // 0x2040(0x30)
	struct FMantle_TraceSettings Fill trace seeting; // 0x2070(0x14)
	struct FVector Location; // 0x2084(0x0c)
	struct FRotator Rotation; // 0x2090(0x0c)
	bool Ragdoll onGround; // 0x209c(0x01)
	enum class ALS_OverlayState overlaystate; // 0x209d(0x01)
	char pad_209E[0x2]; // 0x209e(0x02)
	struct UAnimMontage* GetUp Front Default; // 0x20a0(0x08)
	struct UAnimMontage* Get up Back Default; // 0x20a8(0x08)
	bool RagdollFaceup; // 0x20b0(0x01)
	char pad_20B1[0x3]; // 0x20b1(0x03)
	struct FVector Last Ragdoll Velocity; // 0x20b4(0x0c)
	bool IsMan; // 0x20c0(0x01)
	enum class Als_AimState Aimstate; // 0x20c1(0x01)
	enum class ALS_RotationMode Rotation mode; // 0x20c2(0x01)
	char pad_20C3[0x1]; // 0x20c3(0x01)
	float Airlocation; // 0x20c4(0x04)
	struct TArray<int32_t> StelathArray; // 0x20c8(0x10)
	bool IsStealth; // 0x20d8(0x01)
	char pad_20D9[0x3]; // 0x20d9(0x03)
	int32_t HumanID; // 0x20dc(0x04)
	struct TArray<struct AActor*> OutLineGroundProp; // 0x20e0(0x10)
	struct UMaterialInstanceDynamic* DynamicPostMaterial; // 0x20f0(0x08)
	bool IsCompassTmpState; // 0x20f8(0x01)
	char pad_20F9[0x7]; // 0x20f9(0x07)
	struct TMap<int32_t, struct UMaterialInterface*> MehsMaterial; // 0x2100(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> ClothMaterial; // 0x2150(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> HairMaterial; // 0x21a0(0x50)
	struct FCameraSettings PrevtCameraSetting; // 0x21f0(0x50)
	struct FCameraSettings DefaultCameraSetting; // 0x2240(0x50)
	struct FMantle_TraceSettings ValutTraceSetting; // 0x2290(0x14)
	char pad_22A4[0xc]; // 0x22a4(0x0c)
	struct FTransform ValutTargetTransform; // 0x22b0(0x30)
	struct FValut_Asset ValutAsset; // 0x22e0(0x40)
	struct FTransform Valut Actual Start Tranform; // 0x2320(0x30)
	struct FTransform ValutAnimation; // 0x2350(0x30)
	struct FTransform ValutNextTarget; // 0x2380(0x30)
	enum class ALS_MovementAction MoveAction; // 0x23b0(0x01)
	enum class EHealthState TempHealthState; // 0x23b1(0x01)
	char pad_23B2[0x2]; // 0x23b2(0x02)
	int32_t SprintKeyPressTime; // 0x23b4(0x04)
	struct TMap<char, struct FCameraSettings> CameraSetting; // 0x23b8(0x50)
	struct ABP_PlayerHumanBase_C* CureHuman; // 0x2408(0x08)
	int32_t LoseShiGouRemainingTime; // 0x2410(0x04)
	char pad_2414[0x4]; // 0x2414(0x04)
	struct FTimerHandle DecreaseTimer; // 0x2418(0x08)
	struct FRotator OriginalRotation; // 0x2420(0x0c)
	struct FRotator TargetRotation; // 0x242c(0x0c)
	struct FRotator OriginalControlRotation; // 0x2438(0x0c)
	struct FVector TargetRagDollLocation; // 0x2444(0x0c)
	struct FMulticastInlineDelegate OnOutLine; // 0x2450(0x10)
	struct AActor* wallActor; // 0x2460(0x08)
	float OriginalCapsuleHalfHeight; // 0x2468(0x04)
	struct FVector MeshOriginalRelativeLocation; // 0x246c(0x0c)
	bool Rotate_L; // 0x2478(0x01)
	bool Rotate_R; // 0x2479(0x01)
	char pad_247A[0x2]; // 0x247a(0x02)
	float RotateMinThreshold; // 0x247c(0x04)
	float RotateMaxThreshold; // 0x2480(0x04)
	char pad_2484[0x4]; // 0x2484(0x04)
	struct UWBP_QuickToSpeak_C* QuickToSpeak; // 0x2488(0x08)
	struct FTimerHandle Timehandel; // 0x2490(0x08)
	struct FRotator FlashNormalRotator; // 0x2498(0x0c)
	struct FRotator FlashDamaged Rotator; // 0x24a4(0x0c)
	struct FALS_CameraSettingGroup cameragroup; // 0x24b0(0xf0)
	struct FVector OriginalLocation; // 0x25a0(0x0c)
	struct FVector OriginalInteractBoxExtent; // 0x25ac(0x0c)
	struct UWBP_SettingMain_C* SettingBoard; // 0x25b8(0x08)
	struct FRotator MeshOriginalRelativeRotation; // 0x25c0(0x0c)
	char pad_25CC[0x4]; // 0x25cc(0x04)
	struct TMap<int32_t, struct UMaterialInterface*> ConjoinedBodyCompMat; // 0x25d0(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> LowerClothComMat; // 0x2620(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> HeadComMat; // 0x2670(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> FaceCommat; // 0x26c0(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> BackComMat; // 0x2710(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> ShoesComMat; // 0x2760(0x50)
	struct TArray<struct USkeletalMeshComponent*> DefalutsMeshes; // 0x27b0(0x10)
	struct TArray<struct FName> MeshMaterialNames; // 0x27c0(0x10)
	struct TArray<struct UMaterialInterface*> SkeletalMeshMaterials; // 0x27d0(0x10)
	struct FRotator gangrotaionoffset; // 0x27e0(0x0c)
	float ideatime; // 0x27ec(0x04)
	struct ABP_PlayerHumanBase_C* PullHuman; // 0x27f0(0x08)
	int32_t GetAutoNum; // 0x27f8(0x04)
	char pad_27FC[0x4]; // 0x27fc(0x04)
	struct UKxInventoryObject* CurHandItem; // 0x2800(0x08)
	struct TArray<enum class EObjectTypeQuery> TrackType; // 0x2808(0x10)
	bool RightShoulder; // 0x2818(0x01)
	char pad_2819[0x7]; // 0x2819(0x07)
	struct UUserWidget* Cameraui; // 0x2820(0x08)
	bool isPowerJump; // 0x2828(0x01)
	char pad_2829[0x3]; // 0x2829(0x03)
	struct FMantle_TraceSettings Fill Valut Trace Settings; // 0x282c(0x14)
	int32_t AniminstanceInt; // 0x2840(0x04)
	struct FVector StartPos; // 0x2844(0x0c)
	struct FCalibrationOffset biaoqing; // 0x2850(0xd8)
	struct TArray<struct UMaterialInstanceDynamic*> PiBianMatBlend; // 0x2928(0x10)
	struct USkeletalMesh* Pi; // 0x2938(0x08)
	struct USkeletalMesh* Default; // 0x2940(0x08)
	struct TArray<struct UMaterialInterface*> MeshMatrails; // 0x2948(0x10)
	bool bAutoMove; // 0x2958(0x01)
	char pad_2959[0x7]; // 0x2959(0x07)
	struct TArray<struct FName> PibianMname; // 0x2960(0x10)
	struct TMap<struct FName, struct UMaterialInstance*> Name; // 0x2970(0x50)
	struct FPostProcessSettings CameraPostseeting; // 0x29c0(0x550)
	int32_t GC_TerritoryDebuffCount; // 0x2f10(0x04)
	char pad_2F14[0x4]; // 0x2f14(0x04)
	struct UPostProcessComponent* PPC_TerritoryDebuff; // 0x2f18(0x08)
	struct UMaterialInstanceDynamic* DMI_TerritoryDebuff; // 0x2f20(0x08)
	bool DisableMove; // 0x2f28(0x01)

	void SetOtherCamera(bool isother, struct FRotator Rotator); // Function BP_PlayerHumanBase.BP_PlayerHumanBase_C.SetOtherCamera // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void BPI_Get_CameraParameters(float TP_FOV, float FP_FOV, bool RightShoulder); // Function BP_PlayerHumanBase.BP_PlayerHumanBase_C.BPI_Get_CameraParameters // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	struct FVector BPI_Get_FP_CameraTarget(); // Function BP_PlayerHumanBase.BP_PlayerHumanBase_C.BPI_Get_FP_CameraTarget // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	struct FTransform BPI_Get_3P_PivotTarget(); // Function BP_PlayerHumanBase.BP_PlayerHumanBase_C.BPI_Get_3P_PivotTarget // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
