// UserDefinedStruct BS_juwai.BS_juwai
// Size: 0x48 (Inherited: 0x00)
struct FBS_juwai {
	struct UAnimSequence* idleAnim_34_6D1420A8497B50E6FF8A249D17648146; // 0x00(0x08)
	struct UAnimSequence* poseAnim_35_F4D1BDA64971AF0EF61A768A3AB27C83; // 0x08(0x08)
	struct UAnimSequence* kanbanidleone_36_27AAE9DC4FB18092B6106C99AD14FEBA; // 0x10(0x08)
	struct TArray<struct UAnimSequence*> kanbanshowone_44_8A9C50804A0327E0F1242ABEA61484DA; // 0x18(0x10)
	bool isman_18_A1B49CDD4D31AA2CB11694811BB606E0; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct UAnimSequence* biaoqingsequence_39_08E4A1B043F538B5B75BD7B06B99D2C9; // 0x30(0x08)
	struct UAnimSequence* kanbanidletwo_40_AE82545C4325C75CAC93639E42A80B9C; // 0x38(0x08)
	struct UAnimSequence* kanbanidlethree_42_835508454E1008C7F3760A982CE4F39B; // 0x40(0x08)
};

