// UserDefinedStruct CalibrationOffset.CalibrationOffset
// Size: 0xd8 (Inherited: 0x00)
struct FCalibrationOffset {
	float eyeBlinkLeft_2_2233687548D877BD30BE53975A76EC04; // 0x00(0x04)
	float eyeLookDownLeft_30_AD255494490EE3172E978BBB253C812C; // 0x04(0x04)
	float eyeLookInLeft_31_39410013489D561977E5BE9B8BD8348A; // 0x08(0x04)
	float eyeLookOutLeft_32_427BDA7B496371093EA6BD8A9FF276B8; // 0x0c(0x04)
	float eyeLookUpLeft_33_E2AC1ECB43FC8B50862353A60153AB3B; // 0x10(0x04)
	float eyeSquintLeft_34_3EDF536740027045292F34A1AA205BA4; // 0x14(0x04)
	float eyeWideLeft_35_41823001439FEE2735D2CDB989B2D417; // 0x18(0x04)
	float eyeBlinkRight_36_609033964533396DCAFBA2AC4CD98E04; // 0x1c(0x04)
	float eyeLookDownRight_37_2703180A4D35E0E46E7D9C90CDB2280C; // 0x20(0x04)
	float eyeLookInRight_38_3FDD02B04C8CEBEBDAE9AA8BAE711FED; // 0x24(0x04)
	float eyeLookOutRight_39_511303AE4EC04DEF5A4E7096D65F972B; // 0x28(0x04)
	float eyeLookUpRight_40_80DF4FE24C245432F6BE3A9EFAF6C69C; // 0x2c(0x04)
	float eyeSquintRight_41_7DFE65634E3ED767237078AE5D5CAD42; // 0x30(0x04)
	float eyeWideRight_42_4C5C898044FE2D092053A3BD03376E15; // 0x34(0x04)
	float jawForward_43_B0C28BED40245A73F8F313A4AB11D51A; // 0x38(0x04)
	float jawLeft_44_79B6B76D41B6293CD92C3FA1D7589D41; // 0x3c(0x04)
	float jawRight_45_694092274DF3A9A6FF1257BEA86C5B56; // 0x40(0x04)
	float jawOpen_46_5597B5894EC9C3AEBD40DA85E773BBD6; // 0x44(0x04)
	float mouthClose_47_6742139C4F025EE0C21199BDFE48E27B; // 0x48(0x04)
	float mouthFunnel_48_40B195BC461D9567185ABDA452AFF2ED; // 0x4c(0x04)
	float mouthPucker_49_5153C2054029BF7D6EA2BD822D561ACB; // 0x50(0x04)
	float mouthLeft_50_7FC4EDD144FE1A7FE07531A21E23C062; // 0x54(0x04)
	float mouthRight_51_F8C01F4346016887E63A41AB17D50152; // 0x58(0x04)
	float mouthSmileLeft_52_58C0273449F8D7DF8C5F2A9BA0E4C6DD; // 0x5c(0x04)
	float mouthSmileRight_53_1B6EB11C40483CB535A1E0AF0229E24C; // 0x60(0x04)
	float mouthFrownLeft_54_B50C6CC94FEA607F1643E5864809BBC3; // 0x64(0x04)
	float mouthFrownRight_55_0B5831134837828AC9D8419FBECC5135; // 0x68(0x04)
	float mouthDimpleLeft_56_A4E3C8414E1225DA4E90CB9A866BBF45; // 0x6c(0x04)
	float mouthDimpleRight_58_5D2AB8EC482C0747D87264ACCD6FD90A; // 0x70(0x04)
	float mouthStretchLeft_85_2E442E8344581F4A989E6AB6CE1A0E95; // 0x74(0x04)
	float mouthStretchRight_86_B1AE422349BD7B23B48273AD3DF0D8DA; // 0x78(0x04)
	float mouthRollLower_87_895C98204D9171C56115AC827B80ADF2; // 0x7c(0x04)
	float mouthRollUpper_88_3E12A108464E7FC938CB95804F3F7891; // 0x80(0x04)
	float mouthShrugLower_89_1083B61F498770E9D1305F955406A9AF; // 0x84(0x04)
	float mouthShrugUpper_90_41B8136C49ECF5604BED3693F6B51B1C; // 0x88(0x04)
	float mouthPressLeft_91_6E9338C94CEA86A3E16EDE96E72C0A91; // 0x8c(0x04)
	float mouthPressRight_92_9C6EEDC34D6CD37F2AA8F796B44613D8; // 0x90(0x04)
	float mouthLowerDownLeft_93_3E452C464004E238E19DA780371CCD0B; // 0x94(0x04)
	float mouthLowerDownRight_94_42040B634573DF823C3DBE813CD298CF; // 0x98(0x04)
	float mouthUpperUpLeft_95_806470E942C68129762624946C1B206A; // 0x9c(0x04)
	float mouthUpperUpRight_96_05E4D34E451AD3D091DB42AE452242AD; // 0xa0(0x04)
	float browDownLeft_97_B33225D14B9BD0EB8D95FCB65B8D6F57; // 0xa4(0x04)
	float browDownRight_98_24860F474F389265543A90A8A372CA0B; // 0xa8(0x04)
	float browInnerUp_99_8AF1D72F49EA15F3DD01B4A8ADCACF3F; // 0xac(0x04)
	float browOuterUpLeft_100_36262FEC46529BB31EE6C4BBCF7D9DF6; // 0xb0(0x04)
	float browOuterUpRight_101_630AF6EA464A87301A26A9BA187AF70B; // 0xb4(0x04)
	float cheekPuff_102_A650600247DEAC45A176F38081831BB9; // 0xb8(0x04)
	float cheekSquintLeft_103_BFD141DF4E91C8E6C63D22BC096A3DED; // 0xbc(0x04)
	float cheekSquintRight_104_ED98BFA44E3624779DA50AB4B1D7F312; // 0xc0(0x04)
	float noseSneerLeft_105_8E0DFA6741CD6CDDB3B219BEC65BB05B; // 0xc4(0x04)
	float noseSneerRight_106_6CC9F9A04FABE498B752D8B6FFEFA101; // 0xc8(0x04)
	float headRoll_109_5FA5781B4F0A599DDA0AA3BD51ABD402; // 0xcc(0x04)
	float headPitch_111_E8507ECD4413639E645AA3874F5D41CF; // 0xd0(0x04)
	float headYaw_113_83875B914BD33E609953FDBE253B807F; // 0xd4(0x04)
};

