// ControlRigBlueprintGeneratedClass CR_Nielian.CR_Nielian_C
// Size: 0x688 (Inherited: 0x650)
struct UCR_Nielian_C : UControlRig {
	float footvalue; // 0x650(0x04)
	float spineValue; // 0x654(0x04)
	float clavalue; // 0x658(0x04)
	float lowvalue; // 0x65c(0x04)
	float handvalue; // 0x660(0x04)
	float footvaluesca; // 0x664(0x04)
	float necklocation; // 0x668(0x04)
	float claupvalue; // 0x66c(0x04)
	float pelvisscale; // 0x670(0x04)
	float Upparmscale; // 0x674(0x04)
	float lowerarmscale; // 0x678(0x04)
	float thightscale; // 0x67c(0x04)
	float calfscale; // 0x680(0x04)
	float xiabascale; // 0x684(0x04)
};

