// AnimBlueprintGeneratedClass man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C
// Size: 0x5121 (Inherited: 0x2c0)
struct Uman_6_Skeleton_AnimBlueprint_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_19; // 0x2c8(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_18; // 0x400(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_17; // 0x538(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_16; // 0x670(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_15; // 0x7a8(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_14; // 0x8e0(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_13; // 0xa18(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_12; // 0xb50(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_11; // 0xc88(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_10; // 0xdc0(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_9; // 0xef8(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_8; // 0x1030(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_7; // 0x1168(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_6; // 0x12a0(0x138)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x13d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x14e0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x15e8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x1608(0x20)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_5; // 0x1628(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_4; // 0x1760(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_3; // 0x1898(0x138)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x19d0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x1a00(0x118)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver_2; // 0x1b18(0x138)
	struct FAnimNode_PoseDriver AnimGraphNode_PoseDriver; // 0x1c50(0x138)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x1d88(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x1ea0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x1ed0(0x118)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7; // 0x1fe8(0x58)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x2040(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2060(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x2168(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2188(0x108)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6; // 0x2290(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0x22e8(0x58)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_2; // 0x2340(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x23e0(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0x2410(0x58)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x2468(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2488(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x2590(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x25b0(0x108)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0x26b8(0x58)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0x2710(0x58)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x2768(0x118)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x2880(0x58)
	struct FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0x28d8(0xa0)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose_2; // 0x2978(0x50)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x29c8(0x30)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0x29f8(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0x2b10(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2c28(0x158)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0x2d80(0x118)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x2e98(0x118)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2fb0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2fd8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x3078(0x28)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x30a0(0x118)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x31b8(0xb0)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_18; // 0x3268(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_17; // 0x3390(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_16; // 0x34b8(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_15; // 0x35e0(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_14; // 0x3708(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_13; // 0x3830(0x128)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x3958(0x20)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_12; // 0x3978(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_11; // 0x3aa0(0x128)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3bc8(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x3c68(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x3c88(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x3cb0(0xb0)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_10; // 0x3d60(0x128)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x3e88(0x20)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_9; // 0x3ea8(0x128)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3fd0(0x118)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_8; // 0x40e8(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_7; // 0x4210(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_6; // 0x4338(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_5; // 0x4460(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_4; // 0x4588(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_3; // 0x46b0(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone_2; // 0x47d8(0x128)
	struct FAnimNode_SpringBone AnimGraphNode_SpringBone; // 0x4900(0x128)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4a28(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x4ad8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x4af8(0x28)
	struct FAnimNode_LiveLinkPose AnimGraphNode_LiveLinkPose; // 0x4b20(0x50)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x4b70(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4c88(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4de0(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x4e08(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x4e28(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x4e48(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4e78(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4e98(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4eb8(0xa0)
	struct FCalibrationOffset caliboffset; // 0x4f58(0xd8)
	struct FCalibrationOffset biaoqingsim; // 0x5030(0xd8)
	struct FLiveLinkSubjectName DeviceName; // 0x5108(0x08)
	bool isautonamous; // 0x5110(0x01)
	bool IsMan; // 0x5111(0x01)
	char pad_5112[0x2]; // 0x5112(0x02)
	struct FRotator lower1_rotatio; // 0x5114(0x0c)
	bool isjuwai; // 0x5120(0x01)

	void bonedriver(struct FPoseLink InPose_4, struct FPoseLink bonedriver); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.bonedriver // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void Simuate(struct FPoseLink InPose_3, struct FPoseLink Simuate); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.Simuate // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void biaoqing(struct FPoseLink InPose_2, struct FPoseLink biaoqing); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.biaoqing // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void xiuxin(struct FPoseLink InPose_1, struct FPoseLink xiuxin); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.xiuxin // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void AnimGraph(struct FPoseLink InPose, struct FPoseLink AnimGraph); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_CF9790B34EBE51C1484DB78C198FC64E(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_CF9790B34EBE51C1484DB78C198FC64E // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F7E115D54A5E8D2E52F45EB0D0A61EBD(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_F7E115D54A5E8D2E52F45EB0D0A61EBD // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5578810E44920BD2400A9D96B515095D(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_5578810E44920BD2400A9D96B515095D // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_683AD6DC4B3CBF21D34ADA8ED7AFD068(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_683AD6DC4B3CBF21D34ADA8ED7AFD068 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_164649C548C9E2158053E7AC5CDED714(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_164649C548C9E2158053E7AC5CDED714 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_98B13A5549C3969A63B418B778F60F9E(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_98B13A5549C3969A63B418B778F60F9E // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_973A9C0E44F37711AAEDEDB044A84274(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyBone_973A9C0E44F37711AAEDEDB044A84274 // (BlueprintEvent) // @ game+0x1ec38f0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_CE623634468C7E39D6518EBBF00678A8(); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_man_6_Skeleton_AnimBlueprint_AnimGraphNode_ModifyCurve_CE623634468C7E39D6518EBBF00678A8 // (BlueprintEvent) // @ game+0x1ec38f0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1ec38f0
	void ExecuteUbergraph_man_6_Skeleton_AnimBlueprint(int32_t EntryPoint); // Function man_6_Skeleton_AnimBlueprint.man_6_Skeleton_AnimBlueprint_C.ExecuteUbergraph_man_6_Skeleton_AnimBlueprint // (Final|UbergraphFunction) // @ game+0x1ec38f0
};

