// UserDefinedStruct S_GuildShop.S_GuildShop
// Size: 0x69 (Inherited: 0x00)
struct FS_GuildShop {
	int32_t ID_6_AFA5F5C6430E2E06C8CAEF8BF6CC8879; // 0x00(0x04)
	char pad_4[0x4]; // 0x04(0x04)
	struct FText ItemName_7_896094DF484895351467EB937018C4FB; // 0x08(0x18)
	int32_t ItemID_9_029FF2464C76BFE1A8C2D5BB4B73AF13; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct FRewardInfo price_12_A5DFDDE144E029FE5B2E248FACF22599; // 0x28(0x10)
	int32_t ShopType_17_5E88B2C9418C1EF9E14FF2A28CDB277D; // 0x38(0x04)
	int32_t time_46_13F9EC7149A51103F2311E8208C0358F; // 0x3c(0x04)
	struct FDateTime deletetime_42_1E15D497487DE7B0C3DC4D82B0EEDD08; // 0x40(0x08)
	struct FGuildItemLimit quota_45_A594702048DC8B2A29F80D9FD0A3CDBE; // 0x48(0x08)
	struct FText Mark_44_F409020F4F36E55254943E9E68947450; // 0x50(0x18)
	bool top_43_3D175490435821C0D0F71FA483CA27C5; // 0x68(0x01)
};

