// UserDefinedStruct Valut_Asset.Valut_Asset
// Size: 0x40 (Inherited: 0x00)
struct FValut_Asset {
	struct UAnimMontage* ValutMontage_2_C6B5CA534F41E25166D1D5BF318B40D2; // 0x00(0x08)
	struct FVector StartOffset_6_49EA5BC447E80AB2C0ED93BE9AE42D4D; // 0x08(0x0c)
	char pad_14[0x4]; // 0x14(0x04)
	struct UCurveVector* oneValutCurve_12_3903ADA34A35DD5058D1359954DAFDA5; // 0x18(0x08)
	struct UCurveVector* twoValutCurve_13_F9CF736E437A03417B5DE884649824BB; // 0x20(0x08)
	float height_16_F18525254BB6040AC36684AAB057ECA7; // 0x28(0x04)
	float startpostion_18_7D120F8C45FD6A354349039F4A3C54EA; // 0x2c(0x04)
	float playrate_21_FD5D0CC548C77D98050B699B7F8F550F; // 0x30(0x04)
	float forwarddistance_24_C917FD724BBDE8534722939F14763E5B; // 0x34(0x04)
	float lowheight_27_DC8E228945A0D0F2F1B996891AAA734A; // 0x38(0x04)
	float higheight_28_302D7322454BE32E394642BB24681E1B; // 0x3c(0x04)
};

