// WidgetBlueprintGeneratedClass WBP_PC_GhostRecordSingle.WBP_PC_GhostRecordSingle_C
// Size: 0x2a0 (Inherited: 0x260)
struct UWBP_PC_GhostRecordSingle_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UButton* Button_76; // 0x268(0x08)
	struct UButton* Button_149; // 0x270(0x08)
	struct UButton* Button_215; // 0x278(0x08)
	struct UImage* Image_79; // 0x280(0x08)
	struct UImage* Image_759; // 0x288(0x08)
	struct UImage* Image_908; // 0x290(0x08)
	struct UImage* Image_1029; // 0x298(0x08)

	void SetData(); // Function WBP_PC_GhostRecordSingle.WBP_PC_GhostRecordSingle_C.SetData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void InitData(struct FPBBattleGhostInfo GhostInfo); // Function WBP_PC_GhostRecordSingle.WBP_PC_GhostRecordSingle_C.InitData // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void Construct(); // Function WBP_PC_GhostRecordSingle.WBP_PC_GhostRecordSingle_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1ec38f0
	void ExecuteUbergraph_WBP_PC_GhostRecordSingle(int32_t EntryPoint); // Function WBP_PC_GhostRecordSingle.WBP_PC_GhostRecordSingle_C.ExecuteUbergraph_WBP_PC_GhostRecordSingle // (Final|UbergraphFunction) // @ game+0x1ec38f0
};

