// AnimBlueprintGeneratedClass YujiNew_ALS_Yuji.YujiNew_ALS_Yuji_C
// Size: 0xfda4 (Inherited: 0x2c0)
struct UYujiNew_ALS_Yuji_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0x2c8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0x420(0x158)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x578(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0x640(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0x668(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0x690(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0x7e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x8b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x8d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x978(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_27; // 0x9a0(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0x9f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0xa20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0xa48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0xa70(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_18; // 0xa98(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0xae8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_26; // 0xb18(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0xb70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0xb98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0xbc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0xbe8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_17; // 0xc10(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0xc60(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_25; // 0xc90(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0xce8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0xd10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0xd38(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_16; // 0xd60(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0xdb0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0xdd8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_24; // 0xe08(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0xe60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0xe88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0xeb0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_15; // 0xed8(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0xf28(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0xf50(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_23; // 0xf80(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0xfd8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x1000(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x1028(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_14; // 0x1050(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x10a0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x10c8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_22; // 0x10f8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x1150(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x1178(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x11a0(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_13; // 0x11c8(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x1218(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x1240(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x1270(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x1320(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_8; // 0x13d0(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_19; // 0x1400(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0x1518(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x1670(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x1698(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0x16e0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x1838(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x1860(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x1888(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x1948(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x1970(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x19b8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x1b10(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x1b38(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x1b80(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x1cd8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x1d00(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x1d48(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x1ea0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x1f60(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x2020(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x20e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x2108(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x2130(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0x2158(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0x22b0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x2408(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_18; // 0x2560(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_7; // 0x2678(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x26a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x26d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x26f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x2720(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x2748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x2770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x2798(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x27c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x27e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x2810(0x28)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_5; // 0x2838(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x2928(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_4; // 0x2958(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x2a48(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_3; // 0x2a78(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x2b68(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x2b98(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x2c88(0x30)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x2cb8(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x2da8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x2dd8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x2e88(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x2eb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x2ee0(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x2f08(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x2f58(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x2f88(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x2fd8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x3008(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x30b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x30e8(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x3198(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_17; // 0x31c8(0x118)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x32e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x3300(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x3408(0x108)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x3510(0x1e0)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x36f0(0x1e0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x38d0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x39d8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x3ae0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x3b00(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x3c08(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x3d10(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x3e18(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_16; // 0x3e48(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_15; // 0x3f60(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_14; // 0x4078(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_13; // 0x4190(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_12; // 0x42a8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_11; // 0x43c0(0x118)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x44d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x4500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x4528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x4550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x4578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x45a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x45c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x45f0(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_21; // 0x4618(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x4670(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x4698(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x46c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x46e8(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_12; // 0x4710(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x4760(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_20; // 0x4790(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x47e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x4810(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_11; // 0x4838(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x4888(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x48b0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x48d8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_19; // 0x4908(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x4960(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x4988(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_10; // 0x49b0(0x50)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x4a00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x4a28(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x4a50(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_18; // 0x4a80(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x4ad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x4b00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x4b28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x4b50(0x28)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_9; // 0x4b78(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4bc8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x4bf8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x4c20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x4c48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x4c70(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_17; // 0x4c98(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_8; // 0x4cf0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x4d40(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x4d70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x4d98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x4dc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x4de8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_16; // 0x4e10(0x58)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_7; // 0x4e68(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x4eb8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x4ee8(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x4f98(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x50f0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x5248(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x53a0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x54f8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x5650(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_10; // 0x57a8(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x58c0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x5a18(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x5b70(0x28)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_9; // 0x5b98(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_8; // 0x5cb0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7; // 0x5dc8(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6; // 0x5ee0(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x5ff8(0x158)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6150(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5; // 0x6180(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x6298(0x118)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x63b0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x6508(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x6660(0x158)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x67b8(0x38)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x67f0(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x6828(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x6980(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x6ad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x6b00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x6b28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x6b50(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x6b78(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x6c48(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x6d10(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x6d58(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x6eb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x6ed8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x6f00(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x6f28(0xc0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0x6fe8(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x70b8(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x7180(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x71c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x71f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x7218(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x7240(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x7310(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x73d8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x7420(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x7448(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x7470(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x7498(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x7568(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x7630(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x7678(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x76a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x76c8(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x76f0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x77b8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x7800(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x7828(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x7850(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x7918(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x7960(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x7988(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x79b0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x7b08(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x7c60(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7db8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x7f10(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x8068(0x118)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x8180(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x81a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x81d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x81f8(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x8220(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x82e8(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x83b0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x8470(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x8530(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x85f0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x8618(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x86d8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x8798(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x87c0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x8880(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x8940(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x8988(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x8a48(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x8a70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x8a98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x8ac0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x8ae8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x8b10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x8b38(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x8b60(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x8b88(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x8c48(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x8c78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x8ca0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x8cc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x8cf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x8d18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x8d40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x8d68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x8d90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x8db8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x8de0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x8e08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x8e30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x8e58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x8e80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x8ea8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x8ed0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x8ef8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x8f20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x8f48(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_15; // 0x8f70(0x58)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x8fc8(0xd0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x9098(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x9160(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x91e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x9260(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x9290(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x92b8(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_14; // 0x92e0(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x9338(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x9400(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x9480(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x9500(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_13; // 0x9530(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x9588(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x9650(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x96a0(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x96f0(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x97b8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x9880(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x9968(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x9990(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x99b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x99e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x9a08(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x9a30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x9ab0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x9ae0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x9b60(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x9b90(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x9c58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x9cd8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x9d58(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x9d88(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x9e50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x9ed0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x9f50(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x9f80(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x9fb0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0xa060(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0xa090(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0xa158(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0xa240(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0xa308(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0xa358(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xa3a8(0xc8)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_12; // 0xa470(0x58)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xa4c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xa590(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xa610(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xa690(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xa710(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0xa7d8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xa808(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_11; // 0xa830(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0xa888(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0xa8b8(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xa968(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xa990(0x28)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_10; // 0xa9b8(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0xaa10(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xaa40(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0xaa70(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0xab20(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xabd0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0xac50(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0xad38(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xae00(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xae80(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xaf30(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xb018(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xb100(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xb1e8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xb2b0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xb398(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xb480(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xb568(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0xb650(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0xb680(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xb730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xb758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xb780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xb7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xb7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xb7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xb820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xb848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xb870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xb898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xb8c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xb8e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xb910(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xb938(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xb9b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xba38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xbab8(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_6; // 0xbb38(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xbb88(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xbc50(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xbc80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xbca8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xbcd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xbd50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xbdd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xbe50(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_5; // 0xbed0(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xbf20(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xbfe8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xc018(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xc040(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xc0c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xc140(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xc1c0(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_4; // 0xc240(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xc290(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xc358(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xc388(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xc3b0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xc3e0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xc408(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xc438(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xc460(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xc4e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xc560(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xc5e0(0x80)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_3; // 0xc660(0x50)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xc6b0(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xc778(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xc7a8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xc858(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xc8a0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xc9f8(0x158)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0xcb50(0x70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xcbc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xcbe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xcc10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xcc38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xcc60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xcc88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xccb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xccd8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xcd00(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_9; // 0xcd80(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xcdd8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xce08(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_8; // 0xce88(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xcee0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xcf10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xcf38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xcf60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xcf88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xcfb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xcfd8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0xd000(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0xd050(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xd0a0(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0xd150(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xd1a0(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0xd250(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend_2; // 0xd2a0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0xd2f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xd340(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xd390(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_7; // 0xd450(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd4a8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xd4d8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xd500(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xd550(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xd5a0(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xd650(0x50)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xd6a0(0xb0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xd750(0x50)
	struct FAnimNode_MultiWayBlend AnimGraphNode_MultiWayBlend; // 0xd7a0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0xd7f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xd840(0x50)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xd890(0xc0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_6; // 0xd950(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd9a8(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_5; // 0xd9d8(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xda30(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xda58(0x30)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_4; // 0xda88(0x58)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xdae0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xdb08(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xdb38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xdb60(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xdb88(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xdbb0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xdbe0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xdc90(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xdcc0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xdce8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xdd18(0x80)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_3; // 0xdd98(0x58)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0xddf0(0x48)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve_2; // 0xde38(0x58)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xde90(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xdec0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xdf70(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xe0c8(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0xe220(0x48)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0xe268(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xe298(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xe2b8(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xe2d8(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xe430(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xe4e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe508(0x28)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xe530(0x90)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xe5c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xe5f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xe670(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xe6a0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0xe750(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xe858(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xe960(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xea68(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xeb70(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xeb98(0x20)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xebb8(0xc8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xec80(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xeca0(0x50)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0xecf0(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0xeda0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xee70(0x28)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0xee98(0xb0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0xef48(0xd0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0xf018(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xf0c8(0x158)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xf220(0x108)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0xf328(0xb0)
	struct FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0xf3d8(0x58)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xf430(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xf588(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xf5b0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xf650(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0xf678(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0xf6c0(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0xf7d8(0x118)
	struct FAnimNode_Root AnimGraphNode_Root; // 0xf8f0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xf920(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0xf968(0x48)
	struct FRotator AimingRotation; // 0xf9b0(0x0c)
	struct FVector Velocity; // 0xf9bc(0x0c)
	struct FVector RelativeVelocityDirection; // 0xf9c8(0x0c)
	struct FVector Acceleration; // 0xf9d4(0x0c)
	struct FVector MovementInput; // 0xf9e0(0x0c)
	bool IsMoving; // 0xf9ec(0x01)
	bool HasMovementInput; // 0xf9ed(0x01)
	char pad_F9EE[0x2]; // 0xf9ee(0x02)
	float Speed; // 0xf9f0(0x04)
	float MovementInputAmount; // 0xf9f4(0x04)
	enum class GroundedEntryState GroundedEntryState; // 0xf9f8(0x01)
	enum class MovementDirection MovementDirection; // 0xf9f9(0x01)
	enum class HipsDirection TrackedHipsDirection; // 0xf9fa(0x01)
	char pad_F9FB[0x1]; // 0xf9fb(0x01)
	struct FVector RelativeAccelerationAmount; // 0xf9fc(0x0c)
	bool ShouldMove; // 0xfa08(0x01)
	bool Rotate_L; // 0xfa09(0x01)
	bool Rotate_R; // 0xfa0a(0x01)
	bool Pivot; // 0xfa0b(0x01)
	float RotateRate; // 0xfa0c(0x04)
	float RotationScale; // 0xfa10(0x04)
	float DiagonalScaleAmount; // 0xfa14(0x04)
	float WalkRunBlend; // 0xfa18(0x04)
	float StandingPlayRate; // 0xfa1c(0x04)
	float CrouchingPlayRate; // 0xfa20(0x04)
	float StrideBlend; // 0xfa24(0x04)
	struct FVelocityBlend VelocityBlend; // 0xfa28(0x10)
	struct FLeanAmount LeanAmount; // 0xfa38(0x08)
	struct UCurveFloat* DiagonalScaleAmountCurve; // 0xfa40(0x08)
	struct UCurveFloat* StrideBlend_N_Walk; // 0xfa48(0x08)
	struct UCurveFloat* StrideBlend_N_Run; // 0xfa50(0x08)
	struct UCurveFloat* StrideBlend_C_Walk; // 0xfa58(0x08)
	struct FRotator SmoothedAimingRotation; // 0xfa60(0x0c)
	struct FRotator SpineRotation; // 0xfa6c(0x0c)
	struct FVector2D AimingAngle; // 0xfa78(0x08)
	struct FVector2D SmoothedAimingAngle; // 0xfa80(0x08)
	float AimSweepTime; // 0xfa88(0x04)
	float AimYawRate; // 0xfa8c(0x04)
	float ZoomAmount; // 0xfa90(0x04)
	bool Jumped; // 0xfa94(0x01)
	char pad_FA95[0x3]; // 0xfa95(0x03)
	float JumpPlayRate; // 0xfa98(0x04)
	float FallSpeed; // 0xfa9c(0x04)
	float LandPrediction; // 0xfaa0(0x04)
	char pad_FAA4[0x4]; // 0xfaa4(0x04)
	struct UCurveFloat* LandPredictionCurve; // 0xfaa8(0x08)
	struct UCurveFloat* LeanInAirCurve; // 0xfab0(0x08)
	int32_t OverlayOverrideState; // 0xfab8(0x04)
	float Enable_AimOffset; // 0xfabc(0x04)
	float FootLock_L_Alpha; // 0xfac0(0x04)
	float FootLock_R_Alpha; // 0xfac4(0x04)
	struct FVector FootLock_L_Location; // 0xfac8(0x0c)
	struct FVector FootLock_R_Location; // 0xfad4(0x0c)
	struct FRotator FootLock_L_Rotation; // 0xfae0(0x0c)
	struct FRotator FootLock_R_Rotation; // 0xfaec(0x0c)
	struct FVector FootOffset_L_Location; // 0xfaf8(0x0c)
	struct FVector FootOffset_R_Location; // 0xfb04(0x0c)
	struct FRotator FootOffset_L_Rotation; // 0xfb10(0x0c)
	struct FRotator FootOffset_R_Rotation; // 0xfb1c(0x0c)
	struct FVector PelvisOffset; // 0xfb28(0x0c)
	float PelvisAlpha; // 0xfb34(0x04)
	struct ACharacter* Character; // 0xfb38(0x08)
	float DeltaTimeX; // 0xfb40(0x04)
	float TurnCheckMinAngle; // 0xfb44(0x04)
	float Turn180Threshold; // 0xfb48(0x04)
	float AimYawRateLimit; // 0xfb4c(0x04)
	float ElapsedDelayTime; // 0xfb50(0x04)
	enum class ALS_MovementState MovementState; // 0xfb54(0x01)
	enum class ALS_MovementAction MovementAction; // 0xfb55(0x01)
	enum class ALS_RotationMode RotationMode; // 0xfb56(0x01)
	enum class ALS_Gait Gait; // 0xfb57(0x01)
	enum class ALS_Stance Stance; // 0xfb58(0x01)
	enum class ALS_ViewMode ViewMode; // 0xfb59(0x01)
	enum class ALS_OverlayState overlaystate; // 0xfb5a(0x01)
	char pad_FB5B[0x1]; // 0xfb5b(0x01)
	float BasePose_N; // 0xfb5c(0x04)
	float BasePose_CLF; // 0xfb60(0x04)
	float Arm_L; // 0xfb64(0x04)
	float Arm_L_Add; // 0xfb68(0x04)
	float Arm_L_LS; // 0xfb6c(0x04)
	float Arm_L_MS; // 0xfb70(0x04)
	float Arm_R; // 0xfb74(0x04)
	float Arm_R_Add; // 0xfb78(0x04)
	float Arm_R_LS; // 0xfb7c(0x04)
	float Arm_R_MS; // 0xfb80(0x04)
	float hand_l; // 0xfb84(0x04)
	float hand_r; // 0xfb88(0x04)
	float Legs; // 0xfb8c(0x04)
	float Legs_Add; // 0xfb90(0x04)
	float pelvis; // 0xfb94(0x04)
	float Pelvis_Add; // 0xfb98(0x04)
	float Spine; // 0xfb9c(0x04)
	float Spine_Add; // 0xfba0(0x04)
	float head; // 0xfba4(0x04)
	float Head_Add; // 0xfba8(0x04)
	char pad_FBAC[0x4]; // 0xfbac(0x04)
	struct UCurveVector* YawOffset_FB; // 0xfbb0(0x08)
	struct UCurveVector* YawOffset_LR; // 0xfbb8(0x08)
	float FYaw; // 0xfbc0(0x04)
	float BYaw; // 0xfbc4(0x04)
	float LYaw; // 0xfbc8(0x04)
	float RYaw; // 0xfbcc(0x04)
	float InputYawOffsetTime; // 0xfbd0(0x04)
	float ForwardYawTime; // 0xfbd4(0x04)
	float LeftYawTime; // 0xfbd8(0x04)
	float RightYawTime; // 0xfbdc(0x04)
	float MinAngleDelay; // 0xfbe0(0x04)
	float MaxAngleDelay; // 0xfbe4(0x04)
	float RotateMinThreshold; // 0xfbe8(0x04)
	float RotateMaxThreshold; // 0xfbec(0x04)
	struct FTurnInPlace_Asset N_TurnIP_L90; // 0xfbf0(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R90; // 0xfc10(0x20)
	struct FTurnInPlace_Asset N_TurnIP_L180; // 0xfc30(0x20)
	struct FTurnInPlace_Asset N_TurnIP_R180; // 0xfc50(0x20)
	float AimYawRateMinRange; // 0xfc70(0x04)
	float AimYawRateMaxRange; // 0xfc74(0x04)
	float MinPlayRate; // 0xfc78(0x04)
	float MaxPlayRate; // 0xfc7c(0x04)
	struct FTurnInPlace_Asset CLF_TurnIP_L90; // 0xfc80(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R90; // 0xfca0(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_L180; // 0xfcc0(0x20)
	struct FTurnInPlace_Asset CLF_TurnIP_R180; // 0xfce0(0x20)
	float FlailRate; // 0xfd00(0x04)
	float Enable_HandIK_L; // 0xfd04(0x04)
	float Enable_HandIK_R; // 0xfd08(0x04)
	float AnimatedWalkSpeed; // 0xfd0c(0x04)
	float AnimatedRunSpeed; // 0xfd10(0x04)
	float AnimatedSprintSpeed; // 0xfd14(0x04)
	float AnimatedCrouchSpeed; // 0xfd18(0x04)
	float VelocityBlendInterpSpeed; // 0xfd1c(0x04)
	float GroundedLeanInterpSpeed; // 0xfd20(0x04)
	float InAirLeanInterpSpeed; // 0xfd24(0x04)
	float SmoothedAimingRotationInterpSpeed; // 0xfd28(0x04)
	float InputYawOffsetInterpSpeed; // 0xfd2c(0x04)
	float TriggerPivotSpeedLimit; // 0xfd30(0x04)
	float FootHeight; // 0xfd34(0x04)
	float IK_TraceDistanceAboveFoot; // 0xfd38(0x04)
	float IK_TraceDistanceBelowFoot; // 0xfd3c(0x04)
	float BlendSpine; // 0xfd40(0x04)
	float BaseCrawl; // 0xfd44(0x04)
	enum class ALS_State ALS_State; // 0xfd48(0x01)
	char pad_FD49[0x3]; // 0xfd49(0x03)
	float BaseArmLBlend; // 0xfd4c(0x04)
	float BaseArmRBlend; // 0xfd50(0x04)
	float BaseArmR_Blend; // 0xfd54(0x04)
	enum class Als_AimState Aim_state; // 0xfd58(0x01)
	bool IsMan; // 0xfd59(0x01)
	char pad_FD5A[0x2]; // 0xfd5a(0x02)
	float Leg_add; // 0xfd5c(0x04)
	struct FRotator Foot L Last Rotation; // 0xfd60(0x0c)
	struct FRotator Foot; // 0xfd6c(0x0c)
	bool Isdead; // 0xfd78(0x01)
	bool modifyflash; // 0xfd79(0x01)
	enum class E_PlayerActionType ActionType; // 0xfd7a(0x01)
	char pad_FD7B[0x1]; // 0xfd7b(0x01)
	struct FRotator RotationZ; // 0xfd7c(0x0c)
	bool isright; // 0xfd88(0x01)
	bool ispiskill; // 0xfd89(0x01)
	char pad_FD8A[0x2]; // 0xfd8a(0x02)
	float BlendSp; // 0xfd8c(0x04)
	float addtivespine; // 0xfd90(0x04)
	float Alpha; // 0xfd94(0x04)
	bool Enabled; // 0xfd98(0x01)
	char pad_FD99[0x3]; // 0xfd99(0x03)
	float DisabelFullbody; // 0xfd9c(0x04)
	float AddtiveAim; // 0xfda0(0x04)

	void BPI_GetState(enum class MovementDirection MoveDirection, float Offset); // Function YujiNew_ALS_Yuji.YujiNew_ALS_Yuji_C.BPI_GetState // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void woman(Cycle Blend)(struct FPoseLink wF, struct FPoseLink wb, struct FPoseLink WLB, struct FPoseLink WLF, struct FPoseLink wrb, struct FPoseLink WRF, struct FPoseLink Wsprint, struct FPoseLink woman(Cycle Blend)); // Function YujiNew_ALS_Yuji.YujiNew_ALS_Yuji_C.woman(Cycle Blend) // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
	void BaseBlend(struct FPoseLink Base, struct FPoseLink BaseBlend); // Function YujiNew_ALS_Yuji.YujiNew_ALS_Yuji_C.BaseBlend // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1ec38f0
